{
  "articles": [
    {
      "source": "Yahoo Finance",
      "title": "1 Brilliant Vanguard Index Fund to Buy Before It Soars 25%, According to Wall Street Analysts",
      "link": "https://finance.yahoo.com/news/1-brilliant-vanguard-index-fund-172000410.html",
      "published_date": "2026-02-20T17:20:00Z",
      "scrape_timestamp": "2026-02-20T17:30:39.564198+00:00",
      "content": "1 Brilliant Vanguard Index Fund to Buy Before It Soars 25%, According to Wall Street Analysts David Dierking, The Motley Fool Fri, February 20, 2026 at 9:20 AM PST 3 min read NVDA INTC For the first time in more than three years, investors are giving an extended look to areas of the market beyond tech. Energy and consumer staples are among the best-performing sectors this year. Value and dividend stocks have made a comeback. International equities have been on a tear since the beginning of 2025. Another category that's had a strong start to the year is small caps. Long unloved and ignored, they're getting attention for their comparatively small exposure to tech and attractive valuations. The Russell 2000, a generally accepted benchmark for small caps, is receiving some eye-catching price targets from analysts. Will AI create the world's first trillionaire? Our team just released a report on the one little-known company, called an \"Indispensable Monopoly\" providing the critical technology Nvidia and Intel both need. Continue » The ETF Action database, which compiles price targets for companies within a particular ETF, currently has a 25% 12-month upside target for the Vanguard Russell 2000 ETF (NASDAQ: VTWO) . Let's break down the investment case for this fund heading into the remainder of 2026. Image source: Getty Images. Why Wall Street is turning bullish on small caps again Even though small caps are considered riskier and have more boom/bust potential than large caps , there comes a point where the value and the narrative are impossible to ignore. For example: Valuation concerns about megacaps, potential rate cuts, and a deregulation tailwind would all benefit small caps. Currently, the Russell 2000 is expected  to grow 2026 earnings by 19% compared to a 13% growth forecast for the S&P 500 . The Vanguard Russell 2000 ETF has a price/earnings (P/E) ratio of 18 versus 28 for the Vanguard S&P 500 ETF . It's not often that the value and growth stories both line up for small caps, but that's happening now. And the market has begun to recognize it. Why the Vanguard Russell 2000 ETF is positioned for the next leg Megacaps have dominated the U.S. equity market for years, but concentration risk is beginning to rise. The same \"Magnificent Seven\" stocks that have pulled the major market averages higher are all down year-to-date as of Feb. 13, and they're all down more than 10% from their all-time highs. Tech has become an anchor this year. Small companies tend to disproportionately benefit from lower interest rates because many carry higher debt loads. Current rate-cut expectations are modest, but any unexpected disinflation, growth, or labor market shock could quickly have the Federal Reserve thinking about more rate cuts. Story Continues But if the U.S. economy can maintain a \"soft landing\" or \"no landing\" outcome, small caps could find additional momentum. For years, investors were interested only in the growth stories being offered by large-cap and megacap stocks. The next phase of the market cycle could finally reward the small caps. Should you buy stock in Vanguard Russell 2000 ETF right now? Before you buy stock in Vanguard Russell 2000 ETF, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Vanguard Russell 2000 ETF wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Consider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $415,256 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,151,865 !* Now, it’s worth noting Stock Advisor’s total average return is 892 % — a market-crushing outperformance compared to 194% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors. See the 10 stocks » *Stock Advisor returns as of February 20, 2026. David Dierking has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Vanguard S&P 500 ETF. The Motley Fool has a disclosure policy . 1 Brilliant Vanguard Index Fund to Buy Before It Soars 25%, According to Wall Street Analysts was originally published by The Motley Fool Terms and Privacy Policy CA Privacy Notice Your Privacy Choices More Info",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Yahoo Finance",
      "title": "Diebold Nixdorf (DBD) Reports 2025 Adjusted EPS Doubling to $5.59 and 12% Q4 Revenue Growth",
      "link": "https://finance.yahoo.com/news/diebold-nixdorf-dbd-reports-2025-171520673.html",
      "published_date": "2026-02-20T17:15:20Z",
      "scrape_timestamp": "2026-02-20T17:30:39.564230+00:00",
      "content": "Diebold Nixdorf (DBD) Reports 2025 Adjusted EPS Doubling to $5.59 and 12% Q4 Revenue Growth Maham Fatima Fri, February 20, 2026 at 9:15 AM PST 2 min read DBD Diebold Nixdorf Inc. (NYSE: DBD ) is one of the best new tech stocks to invest in now . On February 12, Diebold Nixdorf reported a doubling of its 2025 adjusted EPS to $5.59. Q4 revenue climbed 12% year-over-year to $1.1 billion, driven by a 17% surge in order entries across the banking and retail sectors. The company’s strategic focus on modular retail solutions and ATM recycling technology has led to significant market gains, including nine new major retail logos in the US grocery and pharmacy sectors. While operating expenses rose by 3.7% due to labor costs and investments in service infrastructure, management noted that the rollout of new field service software is largely complete, positioning the company for margin expansion starting in Q2 2026. Despite a slight decline in retail margins caused by external cyber-related disruptions, the banking segment remains robust with strong branch automation demand in North America and a recovery expected in Latin America. Diebold Nixdorf enters 2026 with a solid $730 million product backlog and anticipates revenue growth to be weighted toward H2 of the year. The CEO emphasized that the company remains disciplined in its capital allocation, prioritizing shareholder returns through buybacks while evaluating tuck-in acquisitions that could immediately bolster its service capabilities and global footprint. Diebold Nixdorf (DBD) Reports 2025 Adjusted EPS Doubling to $5.59 and 12% Q4 Revenue Growth Photo by buian_photos on Unsplash Diebold Nixdorf Inc. (NYSE:DBD) automates, digitizes, and transforms the way people bank and shop worldwide. It operates through two segments: Banking and Retail. While we acknowledge the potential of DBD as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you’re looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock . READ NEXT: 10 Most Profitable Undervalued Stocks to Buy and 11 Best Mining Stocks to Buy According to Wall Street . Disclosure: None. Terms and Privacy Policy CA Privacy Notice Your Privacy Choices More Info",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Yahoo Finance",
      "title": "Remitly Global (RELY) Reports 2025 Revenue Growth of 29% to $1.635B Driven by Active User Surge",
      "link": "https://finance.yahoo.com/news/remitly-global-rely-reports-2025-171511626.html",
      "published_date": "2026-02-20T17:15:11Z",
      "scrape_timestamp": "2026-02-20T17:30:39.564240+00:00",
      "content": "Remitly Global (RELY) Reports 2025 Revenue Growth of 29% to $1.635B Driven by Active User Surge Maham Fatima Fri, February 20, 2026 at 9:15 AM PST 2 min read RELY Remitly Global Inc. (NASDAQ: RELY ) is one of the best new tech stocks to invest in now . On February 18, Remitly Global recorded revenue of $1.635 billion in the full year 2025, which was a 29% increase year-over-year. Q4 was particularly strong with $442 million in revenue and $41 million in net income, driven by a 19% increase in active users to over 9 million. A significant highlight was the surge in high-value transactions, with volume from very high amount senders skyrocketing 105% in the quarter. The company is undergoing a major leadership transition as co-founder Matt Oppenheimer steps into the role of Executive Chairman, passing the CEO mantle to former Amazon and Apple executive Sebastian Gunningham. This shift comes as Remitly scales its product ecosystem through new offerings like Flex, which is a send-now-pay-later service that has already surpassed 120,000 users. Furthermore, the launch of Remitly Business and the integration of advanced AI fraud models have improved operational efficiency, leading to record-low transaction losses and a tripled free cash flow of $283 million for the year. With the company is currently holding less than 4% of the global consumer market, incoming leadership plans to use AI and product velocity to capture a larger share of the vast cross-border payment landscape. Remitly Global (RELY) Reports 2025 Revenue Growth of 29% to $1.635B Driven by Active User Surge Pixabay/Public Domain Remitly Global Inc. (NASDAQ:RELY) provides digital financial services in the US, Canada, and internationally. It offers cross-border remittances and complementary financial services through a mobile application and website. While we acknowledge the potential of RELY as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you’re looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock . READ NEXT: 10 Most Profitable Undervalued Stocks to Buy and 11 Best Mining Stocks to Buy According to Wall Street . Disclosure: None. Terms and Privacy Policy CA Privacy Notice Your Privacy Choices More Info",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Yahoo Finance",
      "title": "Netskope (NTSK) Introduces Netskope One Data Lineage for Enhanced Data Tracking, Regulatory Compliance",
      "link": "https://finance.yahoo.com/news/netskope-ntsk-introduces-netskope-one-171456818.html",
      "published_date": "2026-02-20T17:14:56Z",
      "scrape_timestamp": "2026-02-20T17:30:39.564249+00:00",
      "content": "Netskope (NTSK) Introduces Netskope One Data Lineage for Enhanced Data Tracking, Regulatory Compliance Maham Fatima Fri, February 20, 2026 at 9:14 AM PST 2 min read NTSK Netskope Inc. (NASDAQ: NTSK ) is one of the best new tech stocks to invest in now . On February 3, Netskope introduced Netskope One Data Lineage, which is a new capability designed to track the provenance and lifecycle of data as it rests, moves, and is used. This tool is integrated into the Netskope One platform and provides organizations with a verifiable audit trail essential for regulatory compliance, security investigations, and policy enforcement. Netskope Inc. (NASDAQ:NTSK) aims to help businesses safely navigate their AI innovation roadmaps while maintaining strict data governance by offering visibility into how data evolves or propagates across different files and formats. The solution addresses the limitations of legacy data loss prevention/DLP tools, which often fail to correlate data activity across diverse users and systems. Netskope One Data Lineage enables security teams to visualize the entire movement of sensitive information, helping to identify insider threats and establish intent during data loss incidents. Additionally, the platform allows for the proactive adjustment of access policies by providing an extensive historical timeline of document origination, ensuring that sensitive data remains protected even as it is reformatted or extracted. Netskope One Data Lineage is currently in preview and is expected to reach general availability in H1 2026. Netskope (NTSK) Introduces Netskope One Data Lineage for Enhanced Data Tracking, Regulatory Compliance Netskope Inc. (NASDAQ:NTSK) is a cybersecurity company that provides security, networking, and analytics solutions to the largest enterprises and mid-sized companies worldwide. While we acknowledge the potential of NTSK as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you’re looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock . READ NEXT: 10 Most Profitable Undervalued Stocks to Buy and 11 Best Mining Stocks to Buy According to Wall Street . Disclosure: None. Terms and Privacy Policy CA Privacy Notice Your Privacy Choices More Info",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Yahoo Finance",
      "title": "Ralliant Corp. (RAL) Reports Q4 2025 Revenue of $555M Led by 29% Communications Segment Growth",
      "link": "https://finance.yahoo.com/news/ralliant-corp-ral-reports-q4-171447502.html",
      "published_date": "2026-02-20T17:14:47Z",
      "scrape_timestamp": "2026-02-20T17:30:39.564256+00:00",
      "content": "Ralliant Corp. (RAL) Reports Q4 2025 Revenue of $555M Led by 29% Communications Segment Growth Maham Fatima Fri, February 20, 2026 at 9:14 AM PST 2 min read RAL Ralliant Corporation (NYSE: RAL ) is one of the best new tech stocks to invest in now . On February 4, Ralliant reported Q4 2025 revenue of $555 million, which was only a 1% increase year-over-year but exceeded company guidance. Growth was uneven across segments: while the Communications division surged by 29% and Sensors & Safety Systems grew 6%, the Test & Measurement segment saw a 6% decline as customers remained cautious with capital expenditure. The company faced a significant financial setback during the quarter, recording a $1.4 billion non-cash goodwill impairment charge related to its EA Elektro-Automatik business. Management attributed this write-down to a cooling in EV demand and shifts in global subsidies. Additionally, Ralliant is navigating structural cost headwinds following its recent spin-off, which are expected to impact adjusted EBITDA margins by 250 basis points in 2026. Ralliant issued full-year revenue guidance of $2.1 billion to $2.2 billion and adjusted EPS of $2.22 to $2.42 for 2026. While the Test & Measurement segment is expected to remain at the lower end of growth expectations, the company remains committed to a disciplined capital allocation strategy that balances organic investment in AI and digital platforms with strategic tuck-in acquisitions. Ralliant Corp. (RAL) Reports Q4 2025 Revenue of $555M Led by 29% Communications Segment Growth Copyright: franckito / 123RF Stock Photo Ralliant Corporation (NYSE:RAL) designs, develops, manufactures, sells, and services precision instruments and engineered products in the US, China, Western Europe, and internationally. It has two segments: Test & Measurement and Sensors & Safety Systems. While we acknowledge the potential of RAL as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you’re looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock . READ NEXT: 10 Most Profitable Undervalued Stocks to Buy and 11 Best Mining Stocks to Buy According to Wall Street . Disclosure: None. Terms and Privacy Policy CA Privacy Notice Your Privacy Choices More Info",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Yahoo Finance",
      "title": "Employers (EIG) Q4 2025 Earnings Call Transcript",
      "link": "https://finance.yahoo.com/news/employers-eig-q4-2025-earnings-171519049.html",
      "published_date": "2026-02-20T17:15:19Z",
      "scrape_timestamp": "2026-02-20T17:30:39.564264+00:00",
      "content": "Employers (EIG) Q4 2025 Earnings Call Transcript Motley Fool Transcribing, The Motley Fool Fri, February 20, 2026 at 9:15 AM PST 18 min read Image source: The Motley Fool. DATE Friday, Feb. 20, 2026 at 11 a.m. ET CALL PARTICIPANTS President and Chief Executive Officer — Katherine Holt Antonello Executive Vice President and Chief Financial Officer — Michael Aldo Pedraja Full Conference Call Transcript Katherine Holt Antonello: Good morning, everyone, and welcome to our fourth quarter 2025 earnings call. Joining me is Michael Aldo Pedraja, our Chief Financial Officer. During today's call, I will begin by providing highlights of our fourth quarter 2025 results and then hand it over to Michael for more details on our financials. Before our Q&A, I will come back to you with some additional thoughts. I would like to begin with how we are actively addressing the elevated frequency of California cumulative trauma claims. To be clear, this remains a California-specific issue. Claim frequency in our other states and within non-CT claims in California continues to trend favorably. We recognized early that the CT environment was creating a hard market in California, and we moved decisively, have implemented rate increases, and tightened underwriting on several classes of business. We are not waiting for legislative reform, though we do believe the growing impact on California businesses and public budgets will make the case for reform increasingly difficult to ignore. While we are confident that these California pricing and underwriting actions, along with the steps we are taking across the country, will strengthen our underwriting profitability, they are also likely to reduce written premium in 2026. It is worth highlighting that our small commercial franchise maintained strong retention rates throughout 2025, a clear sign the investments we have made in automation and ease of use are genuinely resonating. I am also pleased to report that our standard fourth quarter full actuarial assessment concluded that no additional reserve strengthening or adjustments to our current accident year loss and LAE ratio was necessary. In addition to our internal analysis, we engaged a market-leading actuarial firm to independently assess our estimated ultimate loss, and they concluded that our carried reserves were well within the range of reasonable estimates. We believe the outcome of these two analyses confirms the actions we took in the third quarter adequately addressed recent workers’ compensation trends. I am excited to discuss our new workers’ compensation product, which represents a strategic expansion of our capabilities. By leveraging our core workers’ compensation expertise into the excess layer, we are creating new growth avenues while diversifying our risk profile. Our aggressive adoption of AI tools has accelerated the product’s development, and I am pleased to report that we are now accepting submissions. The early market response has been strong, and we expect this product will deepen our distribution partner relationships while expanding our addressable market. Story Continues We continued to execute on our commitment to returning capital to stockholders by delivering $215,000,000 of share repurchases and regular quarterly dividends in 2025. In January, we completed the $125,000,000 capital recapitalization plan that we announced in the third quarter. These capital management steps reflect our continued confidence in our financial position and our commitment to delivering value to shareholders. Along with our operational performance, these actions increased our book value per share, including the gain, by 11% to $51.31. We believe our focus on disciplined underwriting, prudent risk management, and strategic investments continues to position us strongly in the workers’ compensation insurance market, which is evidenced by A.M. Best’s recent reaffirmation of our insurance companies’ financial strength rating of A. With that, Michael will now provide a deeper dive into our fourth quarter financial results, and then I will return to provide my closing remarks. Michael? Michael Aldo Pedraja: Thank you, Katherine. Gross premiums written were $156,800,000 compared to $176,300,000 for the prior-year quarter, a decrease of 11% due primarily to a decrease in new business writings and lower final audit premiums, partially offset by higher renewal business premium. Our losses and LAE were $134,400,000 versus $113,200,000 a year ago, an increase of 18.7% due primarily to an increase in the accident year 2025 selected loss and LAE ratio and the absence of favorable developments in the fourth quarter of this year. Commission expense was $25,800,000 for the quarter versus $24,400,000 for the prior year, an increase of 5.7% driven by nonrecurring adjustments. Underwriting expenses were $39,800,000 for the quarter versus $44,200,000 for the prior year, a decrease of 10%. The improvement in underwriting expenses for the fourth quarter was due primarily to continued expense management efforts, including reduced personnel costs and other variable costs, such as policyholder dividends and bad debt. Net investment income was $31,400,000 for the quarter compared to $26,700,000 for the prior year, an increase of 17.6%, due mostly to private equity investment return distributions and an overall higher book yield on our fixed income portfolio. As Katherine mentioned, we executed an investment rebalancing to address several strategic goals, including reducing our equity investment allocation to target levels and increasing our overall portfolio yield. Our equity investments, like most in the market, have appreciated very nicely and reached 16% of our investment portfolio versus a target allocation of approximately 10%. As part of the investment rebalancing, we also sold low-yielding fixed income securities to offset the associated equity gains and redeploy the proceeds into higher-yielding fixed income investments. The investment rebalancing accomplished several goals, including reducing our equity investments to target allocation, increasing our overall investment portfolio yield by a net 40 basis points, extracting an estimated net present value gain of $16,000,000, and reducing our required capital. The sale of fixed income investments produced an after-tax realized loss of $40,000,000, which reduced net income and adjusted book value per share during the quarter. Our stockholders’ equity and book value per share were not impacted by the investment rebalancing. Our fixed maturities maintain a modified duration of 4.4 with strong average credit quality of A+. Aided by our investment rebalancing, our weighted average book yield increased to 4.9% at quarter end compared to 4.5% for the prior year. Our adjusted net income, which excludes net realized and unrealized investment gains and losses and the benefit of our LPT deferred gain amortization, was $14,500,000 for the quarter, compared to $28,700,000 last year. During the fourth quarter, we repurchased almost 2,400,000 shares of our common stock at an average price of $40.94 per share, or $97,000,000. The average repurchase price represented a 20% discount to our book value per share, including the deferred gain, and adjusted book value per share. During the period from January 1 through February 18 of this year, the company repurchased a further 898,594 shares of its common stock at an average price of $44.28 per share. Our remaining share repurchase authorization is $53,100,000. As we have highlighted, we aim to be good stewards of our shareholders’ capital. At current price levels, we are convinced that the Employers Holdings, Inc. stock is meaningfully undervalued, and executing share repurchases at these price levels produces a significant return on investment and generates significant value for our continuing shareholders. I will now turn the call back to Katherine. Katherine Holt Antonello: Thank you, Michael. Yesterday, our Boa",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Yahoo Finance",
      "title": "Klarna Group (KLAR) Achieves First Billion-Dollar Revenue Quarter With 38% Q4 2025 Growth",
      "link": "https://finance.yahoo.com/news/klarna-group-klar-achieves-first-171437509.html",
      "published_date": "2026-02-20T17:14:37Z",
      "scrape_timestamp": "2026-02-20T17:30:39.564271+00:00",
      "content": "Klarna Group (KLAR) Achieves First Billion-Dollar Revenue Quarter With 38% Q4 2025 Growth Maham Fatima Fri, February 20, 2026 at 9:14 AM PST 2 min read KLAR Klarna Group (NYSE: KLAR ) is one of the best new tech stocks to invest in now . On February 18, Klarna achieved its first billion-dollar revenue quarter, totaling $1.082 billion in Q4 2025, which was a 38% increase year-over-year. This was fueled by a record GMV of $38.7 billion and a 101% surge in banking consumers, now totaling 15.8 million. These engaged users generate over 3x the revenue of average consumers, reflecting Klarna’s strategic evolution from a payments provider into a global digital bank. The US market served as the primary growth engine, with revenue accelerating 58% year-over-year as Klarna reached 29 million domestic consumers. Market share gains were particularly notable in the Fair Financing segment, which grew 165% as users shifted away from traditional revolving credit. Additionally, the Klarna Card saw significant adoption, ending the quarter with 4.2 million active users, nearly double the count from the previous quarter. Klarna also demonstrated significant operating leverage through AI-driven efficiencies and disciplined underwriting. Since 2022, the company has doubled its revenue while reducing operating expenses by 8% and decreasing headcount by 49%, resulting in a revenue per employee of $1.24 million. Klarna Group (KLAR) Achieves First Billion-Dollar Revenue Quarter With 38% Q4 2025 Growth Klarna Group (NYSE:KLAR) operates as a digital bank and flexible payments provider in the UK, the US, Germany, Sweden, and internationally. The company provides payment and marketing solutions to consumers and merchants. While we acknowledge the potential of KLAR as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you’re looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock . READ NEXT: 10 Most Profitable Undervalued Stocks to Buy and 11 Best Mining Stocks to Buy According to Wall Street . Disclosure: None. Terms and Privacy Policy CA Privacy Notice Your Privacy Choices More Info",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Yahoo Finance",
      "title": "Procore Tech (PCOR) Reports Q4 2025 Revenue Growth of 15.6% to $349M Driven by High-Value Customer Expansion",
      "link": "https://finance.yahoo.com/news/procore-tech-pcor-reports-q4-171430980.html",
      "published_date": "2026-02-20T17:14:30Z",
      "scrape_timestamp": "2026-02-20T17:30:39.564282+00:00",
      "content": "Procore Tech (PCOR) Reports Q4 2025 Revenue Growth of 15.6% to $349M Driven by High-Value Customer Expansion Maham Fatima Fri, February 20, 2026 at 9:14 AM PST 2 min read PCOR Procore Technologies Inc. (NYSE: PCOR ) is one of the best new tech stocks to invest in now . On February 12, Procore Technologies reported Q4 2025 revenue of $349 million, which was a 15.6% year-over-year increase. The company showed strong momentum in high-value segments, with 20% growth in six and seven-figure deals and an expanded base of 2,700+ customers with at least $100,000 in ARR. A major focus of the quarter was the rapid adoption of Procore’s AI initiatives, which now count 66,000 unique active users and nearly 700 customers using the platform to create thousands of custom agents. Procore also acquired Datarid to enhance advanced reasoning and integration. Despite these technological gains, the company continues to navigate a difficult construction environment, specifically citing negative growth in the US non-residential and multi-family sectors, as well as macroeconomic pressures impacting international expansion. For 2026, Procore issued a revenue guidance of $1.489 to $1.494 billion, implying a slightly moderated growth rate of 13%. Management plans to evolve its AI monetization strategy through a mix of new product bundles and consumption-based components, positioning the company to address ongoing labor shortages and productivity challenges within the construction industry. Procore Tech (PCOR) Reports Q4 2025 Revenue Growth of 15.6% to $349M Driven by High-Value Customer Expansion Procore Technologies Inc. (NYSE:PCOR), together with its subsidiaries, provides a cloud-based construction management platform and related products and services in the US and internationally. While we acknowledge the potential of PCOR as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you’re looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock . READ NEXT: 10 Most Profitable Undervalued Stocks to Buy and 11 Best Mining Stocks to Buy According to Wall Street . Disclosure: None. Terms and Privacy Policy CA Privacy Notice Your Privacy Choices More Info",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Yahoo Finance",
      "title": "Rubrik (RBRK) Promotes Jesse Green to Chief Revenue Officer to Lead Global Revenue Organization",
      "link": "https://finance.yahoo.com/news/rubrik-rbrk-promotes-jesse-green-171423292.html",
      "published_date": "2026-02-20T17:14:23Z",
      "scrape_timestamp": "2026-02-20T17:30:39.564290+00:00",
      "content": "Rubrik (RBRK) Promotes Jesse Green to Chief Revenue Officer to Lead Global Revenue Organization Maham Fatima Fri, February 20, 2026 at 9:14 AM PST 2 min read RBRK MDB Rubrik Inc. (NYSE: RBRK ) is one of the best new tech stocks to invest in now . On February 4, Rubrik announced the promotion of Jesse Green to Chief Revenue Officer, where he will lead the company’s global revenue organization. Green previously served as President of Rubrik Americas and brings nearly 25 years of leadership experience from companies such as MongoDB and AppDynamics. He succeeds Brian McCarthy, who is departing for a new opportunity after establishing a strong organizational culture and a track record of consistent results. The leadership transition follows a period of significant momentum for the security and AI operations company. The CEO confirmed that Rubrik delivered a strong Q4, with preliminary financial results exceeding all previously guided metrics. This performance follows a record-breaking Q3 and underscores the company’s rapid growth as it expands its Cyber Resilience and AI Agent Operations platforms globally. Rubrik Inc. (NYSE:RBRK) is now focusing its next phase of scale on enabling trusted AI transformation and agentic work. The company supported its platform through acquisitions like Predibase and Laminar. Rubrik (RBRK) Promotes Jesse Green to Chief Revenue Officer to Lead Global Revenue Organization Copyright: bialasiewicz / 123RF Stock Photo Rubrik Inc. (NYSE:RBRK) provides data security solutions to individuals and businesses worldwide. It offers enterprise, unstructured, cloud, and SaaS data protection solutions; identity provider services protection; data threat analytics; data security posture; and cyber recovery solutions. While we acknowledge the potential of RBRK as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you’re looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock . READ NEXT: 10 Most Profitable Undervalued Stocks to Buy and 11 Best Mining Stocks to Buy According to Wall Street . Disclosure: None. Terms and Privacy Policy CA Privacy Notice Your Privacy Choices More Info",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Yahoo Finance",
      "title": "Figma (FIG) Reports Q4 2025 Revenue Growth of 40% to $304M, Surpasses $1B Full-Year Mark",
      "link": "https://finance.yahoo.com/news/figma-fig-reports-q4-2025-171412156.html",
      "published_date": "2026-02-20T17:14:12Z",
      "scrape_timestamp": "2026-02-20T17:30:39.564298+00:00",
      "content": "Figma (FIG) Reports Q4 2025 Revenue Growth of 40% to $304M, Surpasses $1B Full-Year Mark Maham Fatima Fri, February 20, 2026 at 9:14 AM PST 2 min read FIG Figma Inc. (NYSE: FIG ) is one of the best new tech stocks to invest in now . On February 18, Figma reported the financial results for Q4 2025, with revenue reaching $304 million, marking a 40% increase year-over-year. For the full year, the company surpassed $1 billion, generating $1.056 billion in total revenue. This growth was supported by a net dollar retention rate of 136% among customers with over $10,000 in ARR and international expansion, which grew 45% compared to the previous year. The company is prioritizing AI-native functionality to drive user engagement and expand its customer base. The CEO highlighted the success of Figma Make and the integration of AI credits, noting that 75% of large customers are already using these credits weekly. However, Figma also anticipates that its non-GAAP operating margin will decrease from 12% in 2025 to 8% in 2026. This is attributed to increased investments in AI infrastructure, elevated stock-based compensation following its IPO, and the costs associated with transitioning to a hybrid monetization model involving both seats and AI credits. Figma provided Q1 2026 revenue guidance of $315 to $317 million and full-year guidance of approximately $1.37 billion. Management remains focused on blurring the lines between design, engineering, and product management through its unified platform. Figma (FIG) Reports Q4 2025 Revenue Growth of 40% to $304M, Surpasses $1B Full-Year Mark Figma Inc. (NYSE:FIG) develops a browser-based tool for designing user interfaces that helps design and development teams build various products. While we acknowledge the potential of FIG as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you’re looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock . READ NEXT: 10 Most Profitable Undervalued Stocks to Buy and 11 Best Mining Stocks to Buy According to Wall Street . Disclosure: None. Terms and Privacy Policy CA Privacy Notice Your Privacy Choices More Info",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Yahoo Finance",
      "title": "Toast (TOST) Reports Q4 2025 Revenue Growth of 22% to $1.6B. Surpasses $2B in ARR",
      "link": "https://finance.yahoo.com/news/toast-tost-reports-q4-2025-171341921.html",
      "published_date": "2026-02-20T17:13:41Z",
      "scrape_timestamp": "2026-02-20T17:30:39.564305+00:00",
      "content": "Toast (TOST) Reports Q4 2025 Revenue Growth of 22% to $1.6B. Surpasses $2B in ARR Maham Fatima Fri, February 20, 2026 at 9:13 AM PST 2 min read TOST Toast Inc. (NYSE: TOST ) is one of the best new tech stocks to invest in now . On February 12, Toast reported its 2025 earnings report, which was highlighted by a 33% increase in recurring gross profit and an expanded adjusted EBITDA margin of 34%. The company added more than 30,000 net locations to its platform, ending the year with a total of 164,000 locations and surpassing $2 billion in ARR. In Q4 alone, the company’s revenue totaled $1.6 billion, which was a 22.05% improvement year-over-year. Toast successfully moved into new markets and expanded its enterprise footprint by signing major brands such as Applebee’s and Firehouse Subs, alongside a successful launch in Australia. The company introduced over 500 new features, including the Toast IQ conversational AI assistant, to enhance platform value and operational efficiency. Despite these gains, the company noted some headwinds, including higher hardware costs driven by memory chip demand and tariffs, as well as a drag on SaaS ARR per location as international and enterprise segments continue to scale. For 2026, Toast projects recurring gross profit growth between 20% and 22%, with adjusted EBITDA guidance set at $775 to $795 million. Management remains focused on long-term expansion through R&D investments in AI and new product rollouts, such as a dedicated drive-thru solution. Toast (TOST) Reports Q4 2025 Revenue Growth of 22% to $1.6B. Surpasses $2B in ARR Copyright: stockbroker / 123RF Stock Photo Toast Inc. (NYSE:TOST) operates a cloud-based digital technology platform for the restaurant industry in the US, Ireland, India, and internationally. While we acknowledge the potential of TOST as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you’re looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock . READ NEXT: 10 Most Profitable Undervalued Stocks to Buy and 11 Best Mining Stocks to Buy According to Wall Street . Disclosure: None. Terms and Privacy Policy CA Privacy Notice Your Privacy Choices More Info",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Yahoo Finance",
      "title": "Tax refunds are big this year, IRS data show. Here's how big.",
      "link": "https://finance.yahoo.com/news/tax-refunds-big-irs-data-171324063.html",
      "published_date": "2026-02-20T17:13:24Z",
      "scrape_timestamp": "2026-02-20T17:30:39.564312+00:00",
      "content": "Tax refunds are big this year, IRS data show. Here's how big. Medora Lee, USA TODAY Fri, February 20, 2026 at 9:13 AM PST 4 min read The number of tax returns the IRS has received so far this tax season is down from last year, but refunds are up double digits, IRS data show. The average refund through Feb. 6 was $2,290, up nearly 11% from $2,065 at the same time in 2025 while total returns received fell 5.2%. The IRS noted refund numbers should rise further, too, as refunds claiming the Earned Income Tax Credit (EITC) or the Additional Child Tax Credit (ACTC) are required by law to be held until Feb. 15. These “refund numbers do not include millions of EITC and ACTC refunds to these taxpayers,” the agency said in its release. “This means the refund numbers expected to be released Feb. 27, for refunds processed through Feb. 20, are expected to be higher.” That should be encouraging news to Americans who are struggling under the weight of elevated prices and a slowing job market , analysts said. “Higher refunds should be a tailwind for consumers, particularly lower income consumers who use tax refunds for debt paydown and big-ticket purchases,” said Mihir Bhatia, analyst at Bank of America. Average refunds are big. How to get mine faster? \"Combining direct deposit with electronic filing is the fastest way to receive your refund ,\" the IRS said. Most refunds are issued in less than 21 days for taxpayers who filed a flawless return electronically and chose direct deposit. Nine out of 10 taxpayers already receive their tax refunds by direct deposit, but to boost that closer to 100%, the IRS began phasing out paper checks last September. \"Paper checks are over 16 times more likely to be lost, stolen, altered, or delayed than electronic payments,\" the IRS said. \"Direct deposit also avoids the possibility that a refund check could be returned to the IRS as undeliverable.\" How do I know when my refund’s coming? Through the IRS \" Where's My Refund \" tool, you can track when the IRS received your tax return, when it approved a refund and when it issued the refund. The money should land in your account within five days from the date the IRS approves your refund. If you mailed a paper return and expect a refund, it could take four weeks or more to process your return, the IRS said. Since refunds for Americans who claimed the EITC/ACTC can’t be released until mid-February for early filers , those taxpayers may have to wait until around March 3 to see their refunds in their bank accounts or on debit cards, if they chose direct deposit and there are no issues with the tax return. If you don’t have a bank account, find one through the FDIC website or the National Credit Union Administration using their Credit Union Locator Tool . Usually, people can open a b a nk account pretty quickly. You can also ask your tax preparer if they offer other electronic payment options. Story Continues Otherwise, you might be able to deposit your refund onto a reloadable prepaid debit card or mobile app. Many reloadable prepaid cards and mobile apps have routing and account numbers, which may be different from the card number. Check with your financial institution to make sure your card or app can receive the deposit and double-check the routing and account numbers. Tax filers saw $172.26 billion in federal income tax refunds head their way through March 24. While that's a great deal of money, the total dollar amount is down $16.4 billion or down 8.7% from a year ago. Tax refunds How should people use their tax refunds? Along with that big check comes big responsibility, so make sure not to spend it all away , financial experts said. Here are some ideas : Since refunds are expected to be larger than usual , splitting a refund can be a convenient way to manage your money. You can split the refund in any proportion you want, sending some to an account for immediate use and some for future savings, in up to three different accounts with U.S. financial institutions, reloadable prepaid debit cards, or mobile apps.  You can use your tax software to do it electronically or use IRS Form 8888, Allocation of Refund if you file a paper return. Plan how to use the refund before receiving it. This “reduces overspending risk by assigning the refund a job in advance -- debt payoff, emergency savings, or essential expenses,” said Paul Ricci, chief executive of personal loans site Best Egg. Put debt reduction and financial health ahead of lifestyle upgrades. “Applying refunds toward high-interest balances can reduce financial stress and improve credit utilization,” Ricci said. “Prioritizing emergency savings – 3 to 6 months of expenses -- helps prevent future reliance on credit when unexpected costs arise.” Medora Lee is a money, markets, and personal finance reporter at USA TODAY. You can reach her at mjlee@usatoday.com and subscribe to our free Daily Money newsletter for personal finance tips and business news every Monday through Friday . This article originally appeared on USA TODAY: Tax refunds are forecast to be big. Early IRS data show it's true Terms and Privacy Policy CA Privacy Notice Your Privacy Choices More Info",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Yahoo Finance",
      "title": "Nextpower (NXT) Announces Multi-Year Supply Agreement With Jinko Solar for Gigawatt-Scale Steel Frames",
      "link": "https://finance.yahoo.com/news/nextpower-nxt-announces-multi-supply-171322875.html",
      "published_date": "2026-02-20T17:13:22Z",
      "scrape_timestamp": "2026-02-20T17:30:39.564319+00:00",
      "content": "Nextpower (NXT) Announces Multi-Year Supply Agreement With Jinko Solar for Gigawatt-Scale Steel Frames Maham Fatima Fri, February 20, 2026 at 9:13 AM PST 2 min read NXT 688223.SS Nextpower Inc. (NASDAQ: NXT ) is one of the best new tech stocks to invest in now . On February 17, Nextpower announced a multi-year supply agreement with Jinko Solar (US) Industries Inc. to provide gigawatt-scale steel solar module frames. Under the terms of the deal, Nextpower will supply at least 1 GW of steel frames, with the potential to scale up to 3 GW over three years. These components will support Jinko Solar’s manufacturing operations at its Jacksonville, Florida facility, with production slated to begin in mid-2026. To support this partnership and further localize its supply chain, Nextpower Inc. (NASDAQ:NXT) intends to expand its manufacturing capacity in the Southeastern US to simplify logistics for direct supply to Jinko Solar’s Florida plant. This move follows Nextpower’s recent growth in Memphis and contributes to a network of over 25 US factories that the company has established or expanded since 2021 to meet the rising demand for domestic solar components. The transition to steel frames offers structural and financial advantages for the solar industry. Independent testing indicates that steel frames provide superior durability and stiffness compared to traditional materials for reliability in extreme weather. Furthermore, using US-made steel frames allows developers to add six percent to a tracker project’s domestic content calculation, helping them align with US Treasury Department guidance and national manufacturing priorities. Nextpower (NXT) Announces Multi-Year Supply Agreement With Jinko Solar for Gigawatt-Scale Steel Frames A production line equipment assembling solar modules. Photo from T1 Energy Nextpower Inc. (NASDAQ:NXT) provides solar tracker technologies and solutions for utility-scale and distributed generation solar applications in the US and internationally. While we acknowledge the potential of NXT as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you’re looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock . READ NEXT: 10 Most Profitable Undervalued Stocks to Buy and 11 Best Mining Stocks to Buy According to Wall Street . Disclosure: None. Terms and Privacy Policy CA Privacy Notice Your Privacy Choices More Info",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Yahoo Finance",
      "title": "Stock Market Today: Nasdaq Leads Charge On Tariff News; Amazon Jumps As Data Play Surges (Live Coverage)",
      "link": "https://www.investors.com/market-trend/stock-market-today/dow-jones-sp500-nasdaq-trump-tariff-decision/?src=A00220&yptr=yahoo",
      "published_date": "2026-02-20T17:08:18Z",
      "scrape_timestamp": "2026-02-20T17:30:39.564327+00:00",
      "content": "",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Yahoo Finance",
      "title": "Why Copart Stock Dropped Today",
      "link": "https://finance.yahoo.com/news/why-copart-stock-dropped-today-170905431.html",
      "published_date": "2026-02-20T17:09:05Z",
      "scrape_timestamp": "2026-02-20T17:30:39.615654+00:00",
      "content": "Why Copart Stock Dropped Today Rich Smith, The Motley Fool Fri, February 20, 2026 at 9:09 AM PST 2 min read CPRT NVDA INTC Junked-car salvager Copart (NASDAQ: CPRT) stock fell 4.5% through 11:30 a.m. ET Friday after missing earnings last night. Heading into its fiscal Q2 2026 report, analysts forecast Copart to earn $0.39 per share on $1.15 billion in sales. In fact, Copart earned just $0.36 per share on sales of $1.12 billion. Will AI create the world's first trillionaire? Our team just released a report on the one little-known company, called an \"Indispensable Monopoly\" providing the critical technology Nvidia and Intel both need. Continue » Image source: Getty Images. Copart Q2 earnings Copart revenues slipped 4% year over year in Q2, resulting in a 10% decline in per-share profit, worsening a decline that began in Q1. Year to date, Copart's sales are down 1%, and earnings are flat against fiscal 2025 at $0.77 per share. That's the bad news. The good news is that Copart's free cash flow is up significantly this year. Although operating cash flow was basically unchanged year over year at $662.8 million, Copart cut its purchases of property and equipment nearly in half, to just $177.7 million. As a result, free cash flow so far this year is a strong $485.1 million -- and trending toward perhaps $970 million through the end of the fiscal year! Is Copart stock a buy? Copart management didn't give much in the way of guidance, but assuming Copart can hit that mark, the stock would be trading for a price-to-free cash flow ratio of 37.4. Back out $5.1 billion in net cash on the balance sheet, and the EV/FCF ratio on this one falls to just 32.1. I can't call the stock a \"buy\" at this valuation -- not with profits flat and revenues falling. But there's no doubt Copart stock is getting cheaper, and it's already a lot cheaper than it was a year ago. Should you buy stock in Copart right now? Before you buy stock in Copart, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Copart wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Consider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $415,256 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,151,865 !* Now, it’s worth noting Stock Advisor’s total average return is 892 % — a market-crushing outperformance compared to 194% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors. Continua a leggere See the 10 stocks » *Stock Advisor returns as of February 20, 2026. Rich Smith has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Copart. The Motley Fool has a disclosure policy . Why Copart Stock Dropped Today was originally published by The Motley Fool Condizioni e Informativa sulla privacy CA Privacy Notice Your Privacy Choices More Info",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Financial Times",
      "title": "US Supreme Court rules Trump’s sweeping tariffs are illegal",
      "link": "https://www.ft.com/content/d00d0663-8716-4323-bda3-2cbfb5b30285",
      "published_date": "Fri, 20 Feb 2026 15:02:05 GMT",
      "scrape_timestamp": "2026-02-20T17:31:15.297981+00:00",
      "content": "Trump tariffs live: US Supreme Court rules Trump’s sweeping tariffs are illegal Subscribe to unlock this article Save 40% on Standard Digital was undefined now undefined for your first year Save now on essential digital access to trusted FT journalism on any device. Savings based on monthly annualised price - offer ends 25th February Save 40% What’s included Standard Digital Stay informed with global news & in-depth analysis Gain clarity from expert opinion First FT: the day’s biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT App on Android & iOS FT Videos & Podcasts 10 monthly gift articles to share Explore more offers. Trial undefined for 4 weeks Then undefined per month. Complete digital access with exclusive insights and industry deep dives on any device. Cancel anytime during your trial. Select What's included Global news & analysis Expert opinion FT App on Android & iOS FT Edit: Access on iOS and web FirstFT: the day's biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT Videos & Podcasts 20 monthly gift articles to share Lex: FT's flagship investment column 15+ Premium newsletters by leading experts FT Digital Edition: our digitised print edition Premium Digital Complete coverage undefined per month Complete digital access with exclusive insights and industry deep dives on any device. Select What's included Global news & analysis Expert opinion FT App on Android & iOS FT Edit: Access on iOS and web FirstFT: the day's biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT Videos & Podcasts 20 monthly gift articles to share Lex: FT's flagship investment column 15+ Premium newsletters by leading experts FT Digital Edition: our digitised print edition FT Digital Edition undefined per year All the content of the FT newspaper on any device (This subscription does not include access to FT.com or the FT App). Select What's included FT Digital Edition: our digitised print edition Global news & analysis Expert opinion Translate instantly to 26 languages Lex: FT's flagship investment column FT Magazines, including HTSI Offline Access Check whether you already have access via your university or organisation. Terms & Conditions apply Explore our full range of subscriptions. For individuals Discover all the plans currently available in your country Digital Print Print + Digital For multiple readers Digital access for organisations. Includes exclusive features and content. FT Professional Why the FT? See why over a million readers pay to read the Financial Times. Find out why",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Financial Times",
      "title": "The Supreme Court has delivered an overdue rebuke to Donald Trump on tariffs",
      "link": "https://www.ft.com/content/26c4bc44-35d0-4946-bc66-13777c9aef7e",
      "published_date": "Fri, 20 Feb 2026 17:00:26 GMT",
      "scrape_timestamp": "2026-02-20T17:31:15.498192+00:00",
      "content": "The Supreme Court has delivered an overdue rebuke to Donald Trump on tariffs Subscribe to unlock this article Save 40% on Standard Digital was undefined now undefined for your first year Save now on essential digital access to trusted FT journalism on any device. Savings based on monthly annualised price - offer ends 25th February Save 40% What’s included Standard Digital Stay informed with global news & in-depth analysis Gain clarity from expert opinion First FT: the day’s biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT App on Android & iOS FT Videos & Podcasts 10 monthly gift articles to share Explore more offers. Trial undefined for 4 weeks Then undefined per month. Complete digital access with exclusive insights and industry deep dives on any device. Cancel anytime during your trial. Select What's included Global news & analysis Expert opinion FT App on Android & iOS FT Edit: Access on iOS and web FirstFT: the day's biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT Videos & Podcasts 20 monthly gift articles to share Lex: FT's flagship investment column 15+ Premium newsletters by leading experts FT Digital Edition: our digitised print edition Premium Digital Complete coverage undefined per month Complete digital access with exclusive insights and industry deep dives on any device. Select What's included Global news & analysis Expert opinion FT App on Android & iOS FT Edit: Access on iOS and web FirstFT: the day's biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT Videos & Podcasts 20 monthly gift articles to share Lex: FT's flagship investment column 15+ Premium newsletters by leading experts FT Digital Edition: our digitised print edition FT Digital Edition undefined per year All the content of the FT newspaper on any device (This subscription does not include access to FT.com or the FT App). Select What's included FT Digital Edition: our digitised print edition Global news & analysis Expert opinion Translate instantly to 26 languages Lex: FT's flagship investment column FT Magazines, including HTSI Offline Access Check whether you already have access via your university or organisation. Terms & Conditions apply Explore our full range of subscriptions. For individuals Discover all the plans currently available in your country Digital Print Print + Digital For multiple readers Digital access for organisations. Includes exclusive features and content. FT Professional Why the FT? See why over a million readers pay to read the Financial Times. Find out why",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Financial Times",
      "title": "US growth falls sharply to 1.4% annualised rate in fourth quarter",
      "link": "https://www.ft.com/content/93dd6f14-47ec-42e7-9506-46e6d6ad69e2",
      "published_date": "Fri, 20 Feb 2026 15:40:43 GMT",
      "scrape_timestamp": "2026-02-20T17:31:15.698452+00:00",
      "content": "US growth falls sharply to 1.4% annualised rate in fourth quarter Subscribe to unlock this article Save 40% on Standard Digital was undefined now undefined for your first year Save now on essential digital access to trusted FT journalism on any device. Savings based on monthly annualised price - offer ends 25th February Save 40% What’s included Standard Digital Stay informed with global news & in-depth analysis Gain clarity from expert opinion First FT: the day’s biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT App on Android & iOS FT Videos & Podcasts 10 monthly gift articles to share Explore more offers. Trial undefined for 4 weeks Then undefined per month. Complete digital access with exclusive insights and industry deep dives on any device. Cancel anytime during your trial. Select What's included Global news & analysis Expert opinion FT App on Android & iOS FT Edit: Access on iOS and web FirstFT: the day's biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT Videos & Podcasts 20 monthly gift articles to share Lex: FT's flagship investment column 15+ Premium newsletters by leading experts FT Digital Edition: our digitised print edition Premium Digital Complete coverage undefined per month Complete digital access with exclusive insights and industry deep dives on any device. Select What's included Global news & analysis Expert opinion FT App on Android & iOS FT Edit: Access on iOS and web FirstFT: the day's biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT Videos & Podcasts 20 monthly gift articles to share Lex: FT's flagship investment column 15+ Premium newsletters by leading experts FT Digital Edition: our digitised print edition FT Digital Edition undefined per year All the content of the FT newspaper on any device (This subscription does not include access to FT.com or the FT App). Select What's included FT Digital Edition: our digitised print edition Global news & analysis Expert opinion Translate instantly to 26 languages Lex: FT's flagship investment column FT Magazines, including HTSI Offline Access Check whether you already have access via your university or organisation. Terms & Conditions apply Explore our full range of subscriptions. For individuals Discover all the plans currently available in your country Digital Print Print + Digital For multiple readers Digital access for organisations. Includes exclusive features and content. FT Professional Why the FT? See why over a million readers pay to read the Financial Times. Find out why",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Financial Times",
      "title": "Email blunder exposes $90bn Russian oil smuggling ring",
      "link": "https://www.ft.com/content/4310f010-2b3c-493e-ba0a-26dc6d156b2e",
      "published_date": "Fri, 20 Feb 2026 11:27:27 GMT",
      "scrape_timestamp": "2026-02-20T17:31:15.898671+00:00",
      "content": "Email blunder exposes $90bn Russian oil smuggling ring Subscribe to unlock this article Save 40% on Standard Digital was undefined now undefined for your first year Save now on essential digital access to trusted FT journalism on any device. Savings based on monthly annualised price - offer ends 25th February Save 40% What’s included Standard Digital Stay informed with global news & in-depth analysis Gain clarity from expert opinion First FT: the day’s biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT App on Android & iOS FT Videos & Podcasts 10 monthly gift articles to share Explore more offers. Trial undefined for 4 weeks Then undefined per month. Complete digital access with exclusive insights and industry deep dives on any device. Cancel anytime during your trial. Select What's included Global news & analysis Expert opinion FT App on Android & iOS FT Edit: Access on iOS and web FirstFT: the day's biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT Videos & Podcasts 20 monthly gift articles to share Lex: FT's flagship investment column 15+ Premium newsletters by leading experts FT Digital Edition: our digitised print edition Premium Digital Complete coverage undefined per month Complete digital access with exclusive insights and industry deep dives on any device. Select What's included Global news & analysis Expert opinion FT App on Android & iOS FT Edit: Access on iOS and web FirstFT: the day's biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT Videos & Podcasts 20 monthly gift articles to share Lex: FT's flagship investment column 15+ Premium newsletters by leading experts FT Digital Edition: our digitised print edition FT Digital Edition undefined per year All the content of the FT newspaper on any device (This subscription does not include access to FT.com or the FT App). Select What's included FT Digital Edition: our digitised print edition Global news & analysis Expert opinion Translate instantly to 26 languages Lex: FT's flagship investment column FT Magazines, including HTSI Offline Access Check whether you already have access via your university or organisation. Terms & Conditions apply Explore our full range of subscriptions. For individuals Discover all the plans currently available in your country Digital Print Print + Digital For multiple readers Digital access for organisations. Includes exclusive features and content. FT Professional Why the FT? See why over a million readers pay to read the Financial Times. Find out why",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Financial Times",
      "title": "Anderson Cooper, the veteran CBS anchor leaves the set",
      "link": "https://www.ft.com/content/8342107a-6cf4-4ccf-9833-221e32682e2e",
      "published_date": "Fri, 20 Feb 2026 16:11:42 GMT",
      "scrape_timestamp": "2026-02-20T17:31:16.098895+00:00",
      "content": "Anderson Cooper, the veteran CBS anchor leaves the set Subscribe to unlock this article Save 40% on Standard Digital was undefined now undefined for your first year Save now on essential digital access to trusted FT journalism on any device. Savings based on monthly annualised price - offer ends 25th February Save 40% What’s included Standard Digital Stay informed with global news & in-depth analysis Gain clarity from expert opinion First FT: the day’s biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT App on Android & iOS FT Videos & Podcasts 10 monthly gift articles to share Explore more offers. Trial undefined for 4 weeks Then undefined per month. Complete digital access with exclusive insights and industry deep dives on any device. Cancel anytime during your trial. Select What's included Global news & analysis Expert opinion FT App on Android & iOS FT Edit: Access on iOS and web FirstFT: the day's biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT Videos & Podcasts 20 monthly gift articles to share Lex: FT's flagship investment column 15+ Premium newsletters by leading experts FT Digital Edition: our digitised print edition Premium Digital Complete coverage undefined per month Complete digital access with exclusive insights and industry deep dives on any device. Select What's included Global news & analysis Expert opinion FT App on Android & iOS FT Edit: Access on iOS and web FirstFT: the day's biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT Videos & Podcasts 20 monthly gift articles to share Lex: FT's flagship investment column 15+ Premium newsletters by leading experts FT Digital Edition: our digitised print edition FT Digital Edition undefined per year All the content of the FT newspaper on any device (This subscription does not include access to FT.com or the FT App). Select What's included FT Digital Edition: our digitised print edition Global news & analysis Expert opinion Translate instantly to 26 languages Lex: FT's flagship investment column FT Magazines, including HTSI Offline Access Check whether you already have access via your university or organisation. Terms & Conditions apply Explore our full range of subscriptions. For individuals Discover all the plans currently available in your country Digital Print Print + Digital For multiple readers Digital access for organisations. Includes exclusive features and content. FT Professional Why the FT? See why over a million readers pay to read the Financial Times. Find out why",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Financial Times",
      "title": "Dear ChatGPT, please construct me an optimal portfolio",
      "link": "https://www.ft.com/content/000d33c8-efc5-46cc-a213-e153b3f6a250",
      "published_date": "Fri, 20 Feb 2026 05:00:14 GMT",
      "scrape_timestamp": "2026-02-20T17:31:16.299110+00:00",
      "content": "Dear ChatGPT, please construct me an optimal portfolio Subscribe to unlock this article Save 40% on Standard Digital was undefined now undefined for your first year Save now on essential digital access to trusted FT journalism on any device. Savings based on monthly annualised price - offer ends 25th February Save 40% What’s included Standard Digital Stay informed with global news & in-depth analysis Gain clarity from expert opinion First FT: the day’s biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT App on Android & iOS FT Videos & Podcasts 10 monthly gift articles to share Explore more offers. Trial undefined for 4 weeks Then undefined per month. Complete digital access with exclusive insights and industry deep dives on any device. Cancel anytime during your trial. Select What's included Global news & analysis Expert opinion FT App on Android & iOS FT Edit: Access on iOS and web FirstFT: the day's biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT Videos & Podcasts 20 monthly gift articles to share Lex: FT's flagship investment column 15+ Premium newsletters by leading experts FT Digital Edition: our digitised print edition Premium Digital Complete coverage undefined per month Complete digital access with exclusive insights and industry deep dives on any device. Select What's included Global news & analysis Expert opinion FT App on Android & iOS FT Edit: Access on iOS and web FirstFT: the day's biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT Videos & Podcasts 20 monthly gift articles to share Lex: FT's flagship investment column 15+ Premium newsletters by leading experts FT Digital Edition: our digitised print edition FT Digital Edition undefined per year All the content of the FT newspaper on any device (This subscription does not include access to FT.com or the FT App). Select What's included FT Digital Edition: our digitised print edition Global news & analysis Expert opinion Translate instantly to 26 languages Lex: FT's flagship investment column FT Magazines, including HTSI Offline Access Check whether you already have access via your university or organisation. Terms & Conditions apply Explore our full range of subscriptions. For individuals Discover all the plans currently available in your country Digital Print Print + Digital For multiple readers Digital access for organisations. Includes exclusive features and content. FT Professional Why the FT? See why over a million readers pay to read the Financial Times. Find out why",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Financial Times",
      "title": "Paramount’s $108bn bid for Warner Bros clears US antitrust hurdle",
      "link": "https://www.ft.com/content/41c51286-ff0d-45d5-aefe-624b5049e01d",
      "published_date": "Fri, 20 Feb 2026 16:47:17 GMT",
      "scrape_timestamp": "2026-02-20T17:31:16.499338+00:00",
      "content": "Paramount’s $108bn bid for Warner Bros clears US antitrust hurdle Subscribe to unlock this article Save 40% on Standard Digital was undefined now undefined for your first year Save now on essential digital access to trusted FT journalism on any device. Savings based on monthly annualised price - offer ends 25th February Save 40% What’s included Standard Digital Stay informed with global news & in-depth analysis Gain clarity from expert opinion First FT: the day’s biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT App on Android & iOS FT Videos & Podcasts 10 monthly gift articles to share Explore more offers. Trial undefined for 4 weeks Then undefined per month. Complete digital access with exclusive insights and industry deep dives on any device. Cancel anytime during your trial. Select What's included Global news & analysis Expert opinion FT App on Android & iOS FT Edit: Access on iOS and web FirstFT: the day's biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT Videos & Podcasts 20 monthly gift articles to share Lex: FT's flagship investment column 15+ Premium newsletters by leading experts FT Digital Edition: our digitised print edition Premium Digital Complete coverage undefined per month Complete digital access with exclusive insights and industry deep dives on any device. Select What's included Global news & analysis Expert opinion FT App on Android & iOS FT Edit: Access on iOS and web FirstFT: the day's biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT Videos & Podcasts 20 monthly gift articles to share Lex: FT's flagship investment column 15+ Premium newsletters by leading experts FT Digital Edition: our digitised print edition FT Digital Edition undefined per year All the content of the FT newspaper on any device (This subscription does not include access to FT.com or the FT App). Select What's included FT Digital Edition: our digitised print edition Global news & analysis Expert opinion Translate instantly to 26 languages Lex: FT's flagship investment column FT Magazines, including HTSI Offline Access Check whether you already have access via your university or organisation. Terms & Conditions apply Explore our full range of subscriptions. For individuals Discover all the plans currently available in your country Digital Print Print + Digital For multiple readers Digital access for organisations. Includes exclusive features and content. FT Professional Why the FT? See why over a million readers pay to read the Financial Times. Find out why",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Financial Times",
      "title": "Amazon service was taken down by AI coding bot",
      "link": "https://www.ft.com/content/00c282de-ed14-4acd-a948-bc8d6bdb339d",
      "published_date": "Fri, 20 Feb 2026 05:00:14 GMT",
      "scrape_timestamp": "2026-02-20T17:31:16.699537+00:00",
      "content": "Amazon service was taken down by AI coding bot Subscribe to unlock this article Save 40% on Standard Digital was undefined now undefined for your first year Save now on essential digital access to trusted FT journalism on any device. Savings based on monthly annualised price - offer ends 25th February Save 40% What’s included Standard Digital Stay informed with global news & in-depth analysis Gain clarity from expert opinion First FT: the day’s biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT App on Android & iOS FT Videos & Podcasts 10 monthly gift articles to share Explore more offers. Trial undefined for 4 weeks Then undefined per month. Complete digital access with exclusive insights and industry deep dives on any device. Cancel anytime during your trial. Select What's included Global news & analysis Expert opinion FT App on Android & iOS FT Edit: Access on iOS and web FirstFT: the day's biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT Videos & Podcasts 20 monthly gift articles to share Lex: FT's flagship investment column 15+ Premium newsletters by leading experts FT Digital Edition: our digitised print edition Premium Digital Complete coverage undefined per month Complete digital access with exclusive insights and industry deep dives on any device. Select What's included Global news & analysis Expert opinion FT App on Android & iOS FT Edit: Access on iOS and web FirstFT: the day's biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT Videos & Podcasts 20 monthly gift articles to share Lex: FT's flagship investment column 15+ Premium newsletters by leading experts FT Digital Edition: our digitised print edition FT Digital Edition undefined per year All the content of the FT newspaper on any device (This subscription does not include access to FT.com or the FT App). Select What's included FT Digital Edition: our digitised print edition Global news & analysis Expert opinion Translate instantly to 26 languages Lex: FT's flagship investment column FT Magazines, including HTSI Offline Access Check whether you already have access via your university or organisation. Terms & Conditions apply Explore our full range of subscriptions. For individuals Discover all the plans currently available in your country Digital Print Print + Digital For multiple readers Digital access for organisations. Includes exclusive features and content. FT Professional Why the FT? See why over a million readers pay to read the Financial Times. Find out why",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Financial Times",
      "title": "Investors pour record sums into European stocks",
      "link": "https://www.ft.com/content/80173261-2b72-41f7-9eae-490aabb14623",
      "published_date": "Fri, 20 Feb 2026 05:00:24 GMT",
      "scrape_timestamp": "2026-02-20T17:31:16.899758+00:00",
      "content": "Investors pour record sums into European stocks Subscribe to unlock this article Save 40% on Standard Digital was undefined now undefined for your first year Save now on essential digital access to trusted FT journalism on any device. Savings based on monthly annualised price - offer ends 25th February Save 40% What’s included Standard Digital Stay informed with global news & in-depth analysis Gain clarity from expert opinion First FT: the day’s biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT App on Android & iOS FT Videos & Podcasts 10 monthly gift articles to share Explore more offers. Trial undefined for 4 weeks Then undefined per month. Complete digital access with exclusive insights and industry deep dives on any device. Cancel anytime during your trial. Select What's included Global news & analysis Expert opinion FT App on Android & iOS FT Edit: Access on iOS and web FirstFT: the day's biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT Videos & Podcasts 20 monthly gift articles to share Lex: FT's flagship investment column 15+ Premium newsletters by leading experts FT Digital Edition: our digitised print edition Premium Digital Complete coverage undefined per month Complete digital access with exclusive insights and industry deep dives on any device. Select What's included Global news & analysis Expert opinion FT App on Android & iOS FT Edit: Access on iOS and web FirstFT: the day's biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT Videos & Podcasts 20 monthly gift articles to share Lex: FT's flagship investment column 15+ Premium newsletters by leading experts FT Digital Edition: our digitised print edition FT Digital Edition undefined per year All the content of the FT newspaper on any device (This subscription does not include access to FT.com or the FT App). Select What's included FT Digital Edition: our digitised print edition Global news & analysis Expert opinion Translate instantly to 26 languages Lex: FT's flagship investment column FT Magazines, including HTSI Offline Access Check whether you already have access via your university or organisation. Terms & Conditions apply Explore our full range of subscriptions. For individuals Discover all the plans currently available in your country Digital Print Print + Digital For multiple readers Digital access for organisations. Includes exclusive features and content. FT Professional Why the FT? See why over a million readers pay to read the Financial Times. Find out why",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Financial Times",
      "title": "Reasons to worry about America’s investment position with the rest of the world",
      "link": "https://www.ft.com/content/8333387f-d23f-4fa8-b16d-365ff11a18ef",
      "published_date": "Fri, 20 Feb 2026 05:00:14 GMT",
      "scrape_timestamp": "2026-02-20T17:31:17.099972+00:00",
      "content": "Reasons to worry about America’s investment position with the rest of the world Subscribe to unlock this article Save 40% on Standard Digital was undefined now undefined for your first year Save now on essential digital access to trusted FT journalism on any device. Savings based on monthly annualised price - offer ends 25th February Save 40% What’s included Standard Digital Stay informed with global news & in-depth analysis Gain clarity from expert opinion First FT: the day’s biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT App on Android & iOS FT Videos & Podcasts 10 monthly gift articles to share Explore more offers. Trial undefined for 4 weeks Then undefined per month. Complete digital access with exclusive insights and industry deep dives on any device. Cancel anytime during your trial. Select What's included Global news & analysis Expert opinion FT App on Android & iOS FT Edit: Access on iOS and web FirstFT: the day's biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT Videos & Podcasts 20 monthly gift articles to share Lex: FT's flagship investment column 15+ Premium newsletters by leading experts FT Digital Edition: our digitised print edition Premium Digital Complete coverage undefined per month Complete digital access with exclusive insights and industry deep dives on any device. Select What's included Global news & analysis Expert opinion FT App on Android & iOS FT Edit: Access on iOS and web FirstFT: the day's biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT Videos & Podcasts 20 monthly gift articles to share Lex: FT's flagship investment column 15+ Premium newsletters by leading experts FT Digital Edition: our digitised print edition FT Digital Edition undefined per year All the content of the FT newspaper on any device (This subscription does not include access to FT.com or the FT App). Select What's included FT Digital Edition: our digitised print edition Global news & analysis Expert opinion Translate instantly to 26 languages Lex: FT's flagship investment column FT Magazines, including HTSI Offline Access Check whether you already have access via your university or organisation. Terms & Conditions apply Explore our full range of subscriptions. For individuals Discover all the plans currently available in your country Digital Print Print + Digital For multiple readers Digital access for organisations. Includes exclusive features and content. FT Professional Why the FT? See why over a million readers pay to read the Financial Times. Find out why",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Financial Times",
      "title": "The ‘incredibly significant’ US military forces surrounding Iran",
      "link": "https://www.ft.com/content/a7da6a98-3368-4853-922a-b9f8451682a3",
      "published_date": "Fri, 20 Feb 2026 16:20:40 GMT",
      "scrape_timestamp": "2026-02-20T17:31:17.300193+00:00",
      "content": "The ‘incredibly significant’ US military forces surrounding Iran Subscribe to unlock this article Save 40% on Standard Digital was undefined now undefined for your first year Save now on essential digital access to trusted FT journalism on any device. Savings based on monthly annualised price - offer ends 25th February Save 40% What’s included Standard Digital Stay informed with global news & in-depth analysis Gain clarity from expert opinion First FT: the day’s biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT App on Android & iOS FT Videos & Podcasts 10 monthly gift articles to share Explore more offers. Trial undefined for 4 weeks Then undefined per month. Complete digital access with exclusive insights and industry deep dives on any device. Cancel anytime during your trial. Select What's included Global news & analysis Expert opinion FT App on Android & iOS FT Edit: Access on iOS and web FirstFT: the day's biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT Videos & Podcasts 20 monthly gift articles to share Lex: FT's flagship investment column 15+ Premium newsletters by leading experts FT Digital Edition: our digitised print edition Premium Digital Complete coverage undefined per month Complete digital access with exclusive insights and industry deep dives on any device. Select What's included Global news & analysis Expert opinion FT App on Android & iOS FT Edit: Access on iOS and web FirstFT: the day's biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT Videos & Podcasts 20 monthly gift articles to share Lex: FT's flagship investment column 15+ Premium newsletters by leading experts FT Digital Edition: our digitised print edition FT Digital Edition undefined per year All the content of the FT newspaper on any device (This subscription does not include access to FT.com or the FT App). Select What's included FT Digital Edition: our digitised print edition Global news & analysis Expert opinion Translate instantly to 26 languages Lex: FT's flagship investment column FT Magazines, including HTSI Offline Access Check whether you already have access via your university or organisation. Terms & Conditions apply Explore our full range of subscriptions. For individuals Discover all the plans currently available in your country Digital Print Print + Digital For multiple readers Digital access for organisations. Includes exclusive features and content. FT Professional Why the FT? See why over a million readers pay to read the Financial Times. Find out why",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Financial Times",
      "title": "Iran preparing deal proposal for US, says foreign minister",
      "link": "https://www.ft.com/content/14c01257-f4dd-4f5a-ae10-e7134462135d",
      "published_date": "Fri, 20 Feb 2026 16:13:14 GMT",
      "scrape_timestamp": "2026-02-20T17:31:17.500458+00:00",
      "content": "Iran preparing deal proposal for US, says foreign minister Subscribe to unlock this article Save 40% on Standard Digital was undefined now undefined for your first year Save now on essential digital access to trusted FT journalism on any device. Savings based on monthly annualised price - offer ends 25th February Save 40% What’s included Standard Digital Stay informed with global news & in-depth analysis Gain clarity from expert opinion First FT: the day’s biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT App on Android & iOS FT Videos & Podcasts 10 monthly gift articles to share Explore more offers. Trial undefined for 4 weeks Then undefined per month. Complete digital access with exclusive insights and industry deep dives on any device. Cancel anytime during your trial. Select What's included Global news & analysis Expert opinion FT App on Android & iOS FT Edit: Access on iOS and web FirstFT: the day's biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT Videos & Podcasts 20 monthly gift articles to share Lex: FT's flagship investment column 15+ Premium newsletters by leading experts FT Digital Edition: our digitised print edition Premium Digital Complete coverage undefined per month Complete digital access with exclusive insights and industry deep dives on any device. Select What's included Global news & analysis Expert opinion FT App on Android & iOS FT Edit: Access on iOS and web FirstFT: the day's biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT Videos & Podcasts 20 monthly gift articles to share Lex: FT's flagship investment column 15+ Premium newsletters by leading experts FT Digital Edition: our digitised print edition FT Digital Edition undefined per year All the content of the FT newspaper on any device (This subscription does not include access to FT.com or the FT App). Select What's included FT Digital Edition: our digitised print edition Global news & analysis Expert opinion Translate instantly to 26 languages Lex: FT's flagship investment column FT Magazines, including HTSI Offline Access Check whether you already have access via your university or organisation. Terms & Conditions apply Explore our full range of subscriptions. For individuals Discover all the plans currently available in your country Digital Print Print + Digital For multiple readers Digital access for organisations. Includes exclusive features and content. FT Professional Why the FT? See why over a million readers pay to read the Financial Times. Find out why",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Financial Times",
      "title": "UK swings to record budget surplus in January while retail sales surge",
      "link": "https://www.ft.com/content/03a830d8-6baf-4f22-8e14-758ec449b291",
      "published_date": "Fri, 20 Feb 2026 17:16:59 GMT",
      "scrape_timestamp": "2026-02-20T17:31:18.232464+00:00",
      "content": "UK swings to record budget surplus in January while retail sales surge Subscribe to unlock this article Save 40% on Standard Digital was undefined now undefined for your first year Save now on essential digital access to trusted FT journalism on any device. Savings based on monthly annualised price - offer ends 25th February Save 40% What’s included Standard Digital Stay informed with global news & in-depth analysis Gain clarity from expert opinion First FT: the day’s biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT App on Android & iOS FT Videos & Podcasts 10 monthly gift articles to share Explore more offers. Trial undefined for 4 weeks Then undefined per month. Complete digital access with exclusive insights and industry deep dives on any device. Cancel anytime during your trial. Select What's included Global news & analysis Expert opinion FT App on Android & iOS FT Edit: Access on iOS and web FirstFT: the day's biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT Videos & Podcasts 20 monthly gift articles to share Lex: FT's flagship investment column 15+ Premium newsletters by leading experts FT Digital Edition: our digitised print edition Premium Digital Complete coverage undefined per month Complete digital access with exclusive insights and industry deep dives on any device. Select What's included Global news & analysis Expert opinion FT App on Android & iOS FT Edit: Access on iOS and web FirstFT: the day's biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT Videos & Podcasts 20 monthly gift articles to share Lex: FT's flagship investment column 15+ Premium newsletters by leading experts FT Digital Edition: our digitised print edition FT Digital Edition undefined per year All the content of the FT newspaper on any device (This subscription does not include access to FT.com or the FT App). Select What's included FT Digital Edition: our digitised print edition Global news & analysis Expert opinion Translate instantly to 26 languages Lex: FT's flagship investment column FT Magazines, including HTSI Offline Access Check whether you already have access via your university or organisation. Terms & Conditions apply Explore our full range of subscriptions. For individuals Discover all the plans currently available in your country Digital Print Print + Digital For multiple readers Digital access for organisations. Includes exclusive features and content. FT Professional Why the FT? See why over a million readers pay to read the Financial Times. Find out why",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Financial Times",
      "title": "Only an army — and true integration — will solve Europe’s defence problem",
      "link": "https://www.ft.com/content/2445132e-7208-4a3e-a493-c565ae1ab5b5",
      "published_date": "Fri, 20 Feb 2026 17:00:07 GMT",
      "scrape_timestamp": "2026-02-20T17:31:18.632949+00:00",
      "content": "Only an army — and true integration — will solve Europe’s defence problem Subscribe to unlock this article Save 40% on Standard Digital was undefined now undefined for your first year Save now on essential digital access to trusted FT journalism on any device. Savings based on monthly annualised price - offer ends 25th February Save 40% What’s included Standard Digital Stay informed with global news & in-depth analysis Gain clarity from expert opinion First FT: the day’s biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT App on Android & iOS FT Videos & Podcasts 10 monthly gift articles to share Explore more offers. Trial undefined for 4 weeks Then undefined per month. Complete digital access with exclusive insights and industry deep dives on any device. Cancel anytime during your trial. Select What's included Global news & analysis Expert opinion FT App on Android & iOS FT Edit: Access on iOS and web FirstFT: the day's biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT Videos & Podcasts 20 monthly gift articles to share Lex: FT's flagship investment column 15+ Premium newsletters by leading experts FT Digital Edition: our digitised print edition Premium Digital Complete coverage undefined per month Complete digital access with exclusive insights and industry deep dives on any device. Select What's included Global news & analysis Expert opinion FT App on Android & iOS FT Edit: Access on iOS and web FirstFT: the day's biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT Videos & Podcasts 20 monthly gift articles to share Lex: FT's flagship investment column 15+ Premium newsletters by leading experts FT Digital Edition: our digitised print edition FT Digital Edition undefined per year All the content of the FT newspaper on any device (This subscription does not include access to FT.com or the FT App). Select What's included FT Digital Edition: our digitised print edition Global news & analysis Expert opinion Translate instantly to 26 languages Lex: FT's flagship investment column FT Magazines, including HTSI Offline Access Check whether you already have access via your university or organisation. Terms & Conditions apply Explore our full range of subscriptions. For individuals Discover all the plans currently available in your country Digital Print Print + Digital For multiple readers Digital access for organisations. Includes exclusive features and content. FT Professional Why the FT? See why over a million readers pay to read the Financial Times. Find out why",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Financial Times",
      "title": "Too hot to hold",
      "link": "https://www.ft.com/content/c960dd3a-4659-46bc-9718-34578292690c",
      "published_date": "Fri, 20 Feb 2026 16:46:48 GMT",
      "scrape_timestamp": "2026-02-20T17:31:19.033359+00:00",
      "content": "Christine Lagarde has pushed back against reports that she will step down from the ECB early",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Financial Times",
      "title": "Supreme Court’s tariff ruling has mixed implications for the Fed",
      "link": "https://www.ft.com/content/af9329a1-562b-4dcf-b6f8-f57d386c5632",
      "published_date": "Fri, 20 Feb 2026 16:24:26 GMT",
      "scrape_timestamp": "2026-02-20T17:31:19.233570+00:00",
      "content": "The risk of a lasting inflationary overshoot is now lower but the US’s fiscal path is likely to be more expansionary",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Financial Times",
      "title": "How Palantir captured the Ministry of Defence",
      "link": "https://www.ft.com/content/5207928a-13e8-4832-8c6f-2e78740c16c9",
      "published_date": "Fri, 20 Feb 2026 16:19:19 GMT",
      "scrape_timestamp": "2026-02-20T17:31:19.634023+00:00",
      "content": "How Palantir captured the Ministry of Defence Subscribe to unlock this article Save 40% on Standard Digital was undefined now undefined for your first year Save now on essential digital access to trusted FT journalism on any device. Savings based on monthly annualised price - offer ends 25th February Save 40% What’s included Standard Digital Stay informed with global news & in-depth analysis Gain clarity from expert opinion First FT: the day’s biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT App on Android & iOS FT Videos & Podcasts 10 monthly gift articles to share Explore more offers. Trial undefined for 4 weeks Then undefined per month. Complete digital access with exclusive insights and industry deep dives on any device. Cancel anytime during your trial. Select What's included Global news & analysis Expert opinion FT App on Android & iOS FT Edit: Access on iOS and web FirstFT: the day's biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT Videos & Podcasts 20 monthly gift articles to share Lex: FT's flagship investment column 15+ Premium newsletters by leading experts FT Digital Edition: our digitised print edition Premium Digital Complete coverage undefined per month Complete digital access with exclusive insights and industry deep dives on any device. Select What's included Global news & analysis Expert opinion FT App on Android & iOS FT Edit: Access on iOS and web FirstFT: the day's biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT Videos & Podcasts 20 monthly gift articles to share Lex: FT's flagship investment column 15+ Premium newsletters by leading experts FT Digital Edition: our digitised print edition FT Digital Edition undefined per year All the content of the FT newspaper on any device (This subscription does not include access to FT.com or the FT App). Select What's included FT Digital Edition: our digitised print edition Global news & analysis Expert opinion Translate instantly to 26 languages Lex: FT's flagship investment column FT Magazines, including HTSI Offline Access Check whether you already have access via your university or organisation. Terms & Conditions apply Explore our full range of subscriptions. For individuals Discover all the plans currently available in your country Digital Print Print + Digital For multiple readers Digital access for organisations. Includes exclusive features and content. FT Professional Why the FT? See why over a million readers pay to read the Financial Times. Find out why",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Financial Times",
      "title": "New York Knicks spin-off puts quirks of sports M&A at centre court",
      "link": "https://www.ft.com/content/95dce95f-b22c-4ccb-a244-f0c946dbc6ce",
      "published_date": "Fri, 20 Feb 2026 16:02:40 GMT",
      "scrape_timestamp": "2026-02-20T17:31:20.034536+00:00",
      "content": "New York Knicks spin-off puts quirks of sports M&A at centre court Subscribe to unlock this article Save 40% on Standard Digital was undefined now undefined for your first year Save now on essential digital access to trusted FT journalism on any device. Savings based on monthly annualised price - offer ends 25th February Save 40% What’s included Standard Digital Stay informed with global news & in-depth analysis Gain clarity from expert opinion First FT: the day’s biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT App on Android & iOS FT Videos & Podcasts 10 monthly gift articles to share Explore more offers. Trial undefined for 4 weeks Then undefined per month. Complete digital access with exclusive insights and industry deep dives on any device. Cancel anytime during your trial. Select What's included Global news & analysis Expert opinion FT App on Android & iOS FT Edit: Access on iOS and web FirstFT: the day's biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT Videos & Podcasts 20 monthly gift articles to share Lex: FT's flagship investment column 15+ Premium newsletters by leading experts FT Digital Edition: our digitised print edition Premium Digital Complete coverage undefined per month Complete digital access with exclusive insights and industry deep dives on any device. Select What's included Global news & analysis Expert opinion FT App on Android & iOS FT Edit: Access on iOS and web FirstFT: the day's biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT Videos & Podcasts 20 monthly gift articles to share Lex: FT's flagship investment column 15+ Premium newsletters by leading experts FT Digital Edition: our digitised print edition FT Digital Edition undefined per year All the content of the FT newspaper on any device (This subscription does not include access to FT.com or the FT App). Select What's included FT Digital Edition: our digitised print edition Global news & analysis Expert opinion Translate instantly to 26 languages Lex: FT's flagship investment column FT Magazines, including HTSI Offline Access Check whether you already have access via your university or organisation. Terms & Conditions apply Explore our full range of subscriptions. For individuals Discover all the plans currently available in your country Digital Print Print + Digital For multiple readers Digital access for organisations. Includes exclusive features and content. FT Professional Why the FT? See why over a million readers pay to read the Financial Times. Find out why",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Financial Times",
      "title": "Hungary blocks €90bn EU loan to Ukraine days before war anniversary",
      "link": "https://www.ft.com/content/9bb03b35-2bf5-44fb-b02e-0dbbc3b87b7f",
      "published_date": "Fri, 20 Feb 2026 15:01:04 GMT",
      "scrape_timestamp": "2026-02-20T17:31:20.635236+00:00",
      "content": "Hungary blocks €90bn EU loan to Ukraine days before war anniversary Subscribe to unlock this article Save 40% on Standard Digital was undefined now undefined for your first year Save now on essential digital access to trusted FT journalism on any device. Savings based on monthly annualised price - offer ends 25th February Save 40% What’s included Standard Digital Stay informed with global news & in-depth analysis Gain clarity from expert opinion First FT: the day’s biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT App on Android & iOS FT Videos & Podcasts 10 monthly gift articles to share Explore more offers. Trial undefined for 4 weeks Then undefined per month. Complete digital access with exclusive insights and industry deep dives on any device. Cancel anytime during your trial. Select What's included Global news & analysis Expert opinion FT App on Android & iOS FT Edit: Access on iOS and web FirstFT: the day's biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT Videos & Podcasts 20 monthly gift articles to share Lex: FT's flagship investment column 15+ Premium newsletters by leading experts FT Digital Edition: our digitised print edition Premium Digital Complete coverage undefined per month Complete digital access with exclusive insights and industry deep dives on any device. Select What's included Global news & analysis Expert opinion FT App on Android & iOS FT Edit: Access on iOS and web FirstFT: the day's biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT Videos & Podcasts 20 monthly gift articles to share Lex: FT's flagship investment column 15+ Premium newsletters by leading experts FT Digital Edition: our digitised print edition FT Digital Edition undefined per year All the content of the FT newspaper on any device (This subscription does not include access to FT.com or the FT App). Select What's included FT Digital Edition: our digitised print edition Global news & analysis Expert opinion Translate instantly to 26 languages Lex: FT's flagship investment column FT Magazines, including HTSI Offline Access Check whether you already have access via your university or organisation. Terms & Conditions apply Explore our full range of subscriptions. For individuals Discover all the plans currently available in your country Digital Print Print + Digital For multiple readers Digital access for organisations. Includes exclusive features and content. FT Professional Why the FT? See why over a million readers pay to read the Financial Times. Find out why",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Financial Times",
      "title": "US GDP growth below expectations unlikely to prompt faster Fed cuts",
      "link": "https://www.ft.com/content/0086c335-a3f1-4e82-8a01-b584276d6cd7",
      "published_date": "Fri, 20 Feb 2026 14:30:10 GMT",
      "scrape_timestamp": "2026-02-20T17:31:20.835462+00:00",
      "content": "Price pressures continued to rise according to the December PCE inflation data",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Financial Times",
      "title": "We need to talk about the Gulf",
      "link": "https://www.ft.com/content/61c7c144-1ccf-4895-8939-ef5d85f8f24b",
      "published_date": "Fri, 20 Feb 2026 14:00:05 GMT",
      "scrape_timestamp": "2026-02-20T17:31:21.035691+00:00",
      "content": "We need to talk about the Gulf Subscribe to unlock this article Save 40% on Standard Digital was undefined now undefined for your first year Save now on essential digital access to trusted FT journalism on any device. Savings based on monthly annualised price - offer ends 25th February Save 40% What’s included Standard Digital Stay informed with global news & in-depth analysis Gain clarity from expert opinion First FT: the day’s biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT App on Android & iOS FT Videos & Podcasts 10 monthly gift articles to share Explore more offers. Trial undefined for 4 weeks Then undefined per month. Complete digital access with exclusive insights and industry deep dives on any device. Cancel anytime during your trial. Select What's included Global news & analysis Expert opinion FT App on Android & iOS FT Edit: Access on iOS and web FirstFT: the day's biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT Videos & Podcasts 20 monthly gift articles to share Lex: FT's flagship investment column 15+ Premium newsletters by leading experts FT Digital Edition: our digitised print edition Premium Digital Complete coverage undefined per month Complete digital access with exclusive insights and industry deep dives on any device. Select What's included Global news & analysis Expert opinion FT App on Android & iOS FT Edit: Access on iOS and web FirstFT: the day's biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT Videos & Podcasts 20 monthly gift articles to share Lex: FT's flagship investment column 15+ Premium newsletters by leading experts FT Digital Edition: our digitised print edition FT Digital Edition undefined per year All the content of the FT newspaper on any device (This subscription does not include access to FT.com or the FT App). Select What's included FT Digital Edition: our digitised print edition Global news & analysis Expert opinion Translate instantly to 26 languages Lex: FT's flagship investment column FT Magazines, including HTSI Offline Access Check whether you already have access via your university or organisation. Terms & Conditions apply Explore our full range of subscriptions. For individuals Discover all the plans currently available in your country Digital Print Print + Digital For multiple readers Digital access for organisations. Includes exclusive features and content. FT Professional Why the FT? See why over a million readers pay to read the Financial Times. Find out why",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Yahoo Finance",
      "title": "French Banking Giant Société Générale Launches Euro Stablecoin On XRP Ledger",
      "link": "https://finance.yahoo.com/news/french-banking-giant-soci-t-083325184.html",
      "published_date": "2026-02-19T08:33:25Z",
      "scrape_timestamp": "2026-02-20T18:34:27.954335+00:00",
      "content": "French Banking Giant Société Générale Launches Euro Stablecoin On XRP Ledger Akriti Seth Thu, February 19, 2026 at 2:33 AM CST 2 min read XRP-USD ETH-USD One of France’s largest banking institutions, Société Générale, is launching a euro-denominated stablecoin, EUR Coinvertible, on the XRP Ledger (XRPL) through its digital asset subsidiary, SG FORGE. It is the first time a major European banking institution has selected XRPL as the primary blockchain for a regulated stablecoin deployment. SG-FORGE, which previously launched the EUR CoinVertible (EURCV) stablecoin on Ethereum in 2023, is now expanding to XRPL. Cassie Craddock, Managing Director, UK & Europe, Ripple said, “Societe Generale-FORGE has long been a pioneer amongst European institutions when it comes to building out a market-leading crypto-assets offering for their customers.” In addition, there is a growing trend of major institutions moving on-chain. Can this be a major validation of XRPL’s enterprise-grade infrastructure? It certainly extends Ripple’s growing partnerships with traditional financial institutions. The move also aligns perfectly with Ripple’s institutional settlement strategy. It focuses on providing the plumbing for banks to move value globally without the friction of the legacy financial system. It signals that high-speed, low-cost networks are becoming essential for modern finance. DISCOVER: Top 20 Crypto to Buy in 2026 Ripple’s Strategy To Position XRPL As “Infrastructure Of Choice For Regulated Financial Institutions Entering Digital Asset Space” Jean-Marc Stenger, CEO of SG-FORGE, emphasized the strategic importance of this expansion. The successful launch of EUR Coinvertible on the XRP Ledger is a new step, reinforcing our commitment to offering next-generation, compliant crypto-assets that promote transparency, security, and scalability. Meanwhile, Ripple executives have called this a “huge win for the ecosystem.” Ripple has been actively courting traditional finance players, particularly in the wake of regulatory clarity initiatives in multiple jurisdictions. The XRP Ledger can process transactions in 3-5 seconds with fees typically under $0.01, making it attractive for institutional payment applications. The partnership aligns with Ripple’s broader strategy to position XRPL as the infrastructure of choice for regulated financial institutions entering the digital asset space. This integration allows the bank to explore new use cases, such as using the stablecoin for trading collateral. It also mirrors similar regulatory wins in the sector, such as the recent approvals for Stripe’s crypto bridge , showcasing how compliance is opening doors for big players. Story Continues However, it is worth noting that while the infrastructure is being built, volume for tokenized assets on XRPL has had to catch up to other chains. This launch could be the catalyst needed to boost liquidity. DISCOVER: 16+ New and Upcoming Binance Listings in 2026 Read original story French Banking Giant Société Générale Launches Euro Stablecoin On XRP Ledger by Akriti Seth at 99bitcoins.com Terms and Privacy Policy Privacy Dashboard More Info",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Yahoo Finance",
      "title": "Southern Company (SO) Maintains Stability Amid Shifting Landscape",
      "link": "https://finance.yahoo.com/news/southern-company-maintains-stability-amid-083808348.html",
      "published_date": "2026-02-19T08:38:08Z",
      "scrape_timestamp": "2026-02-20T18:34:27.954358+00:00",
      "content": "Southern Company (SO) Maintains Stability Amid Shifting Landscape Abdul Rahman Thu, February 19, 2026 at 2:38 AM CST 2 min read SO SOMN The Southern Company (NYSE: SO ) is one of the best infrastructure stocks to buy right now . On January 28, The Southern Company (NYSE:SO) declared a quarterly dividend of $0.74 per share on its common stock. Payment is scheduled for March 6, this year, to shareholders of record on February 17. Southern Company (SO) Maintains Stability Amid Shifting Landscape Pixabay/Public Domain This announcement continues 78 consecutive years of quarterly dividends equal to or greater than the prior quarter. The 74 cents-per-share payment was first declared in April 2025, marking the 24th consecutive annual increase. At the time, CEO Christopher Womack cited employee dedication and predictable growth from state-regulated utilities and long-term contracts as the main reason for the increase. In a different update, on January 20, Wells Fargo analyst Shahriar Pourreza downgraded Southern’s shares from Equal Weight to Underweight and slashed the price target to $84 from $97. Pourreza tied the shift to heightened political volatility in Georgia, following November elections that saw Democrats take two Republican-held seats on the state Public Service Commission. He insisted the decision is not a reflection of management’s ability to execute, and described the leadership as one of the best in the industry. Pourreza recognized Southern’s robust and diverse load growth pipeline in the South East (primarily in Georgia), which is driven by DC’s and industrial manufacturing. That said, Pourreza cautioned that the 2026 election cycle stands to generate more noise and uncertainty for the regulatory construct in Georgia. The Southern Company (NYSE:SO) is an Atlanta, Georgia-based energy utility that provides electricity to 9 million customers through its subsidiaries across the Southeast. The company operates a diverse portfolio of generation assets, including natural gas, coal, nuclear, and renewable facilities. While we acknowledge the potential of SO as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock . READ NEXT: 10 Best S&P 500 Stocks With Highest Upside Potential and 10 Best NYSE Stocks to Buy for the Long Term . Disclosure: None. This article is originally published at Insider Monkey . Terms and Privacy Policy Privacy Dashboard More Info",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Yahoo Finance",
      "title": "Digital Realty (DLR) Expands Global Footprint, Faces EPS Miss",
      "link": "https://finance.yahoo.com/news/digital-realty-dlr-expands-global-083819651.html",
      "published_date": "2026-02-19T08:38:19Z",
      "scrape_timestamp": "2026-02-20T18:34:27.954368+00:00",
      "content": "Digital Realty (DLR) Expands Global Footprint, Faces EPS Miss Abdul Rahman Thu, February 19, 2026 at 2:38 AM CST 2 min read DLR DLR-PJ DLR-PL Digital Realty Trust, Inc. (NYSE: DLR ) is one of the best infrastructure stocks to buy right now . On February 6, 2026, TD Cowen raised its price target on Digital Realty (NYSE:DLR) to $185 from $179 while keeping a Hold rating. The firm cited strong Q4 results and the potential for better renewal spreads through 2026, which could lift Core‑FFO/share growth. Digital Realty (DLR) Expands Global Footprint, Faces EPS Miss Studio Grand Ouest/Shutterstock.com On the same day, February 6, 2026, Citi lowered its price target on Digital Realty to $190 from $212 but maintained a Buy rating. Citi said Q4 results showed progress with bookings and funding, but adjusted the target to reflect lower valuation multiples. Digital Realty reported its Q4 and full‑year 2025 results on February 5, 2026. EPS came in at $0.24, missing analyst estimates of $0.29 by about 17%, while revenue beat expectations at $1.63 billion versus the forecast of $1.58 billion. The company booked $400 million in Q4, bringing full‑year bookings to $1.2 billion. Same‑capital cash NOI grew 4.5% year‑over‑year, and liquidity stood at $7 billion at year‑end. Digital Realty now operates over 300 data centers across 55+ metro areas, with 3 gigawatts of IT capacity in place and 769 megawatts under construction. CEO Andy Power highlighted AI adoption as a major driver, noting power availability as a key constraint. In 2025, Digital Realty expanded into Indonesia and Malaysia, launched its Private AI Exchange (AIPx), and raised $3.2 billion in its first private capital fund. The company also reported over $15 billion of capital available for hyperscale development, with more than 5 gigawatts of future capacity planned. Digital Realty Trust, Inc. (NYSE:DLR) is an Austin, Texas-based real estate investment trust that owns, operates, and invests in carrier-neutral data centers worldwide. The company provides colocation, interconnection, and cloud infrastructure services to more than 5,000 customers across industries. While we acknowledge the potential of DLR as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock . READ NEXT: 10 Best S&P 500 Stocks With Highest Upside Potential and 10 Best NYSE Stocks to Buy for the Long Term . Disclosure: None. This article is originally published at Insider Monkey . Terms and Privacy Policy Privacy Dashboard More Info",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Yahoo Finance",
      "title": "American Water Works (AWK) Expands Scale with Essential Utilities Merger",
      "link": "https://finance.yahoo.com/news/american-water-works-awk-expands-083816528.html",
      "published_date": "2026-02-19T08:38:16Z",
      "scrape_timestamp": "2026-02-20T18:34:27.954376+00:00",
      "content": "American Water Works (AWK) Expands Scale with Essential Utilities Merger Abdul Rahman Thu, February 19, 2026 at 2:38 AM CST 2 min read AWK WTRG American Water Works Company, Inc. (NYSE: AWK ) is one of the best infrastructure stocks to buy right now . On February 10, shareholders of American Water Works Company, Inc. (NYSE:AWK) and Essential Utilities Inc. (NYSE:WTRG) approved merger-related proposals at special meetings held that day. American Water Works (AWK) Expands Scale with Essential Utilities Merger According to American Water, at least 99% of its shares present voted to approve share issuance for the merger. Nearly 95% of Essential Utilities shares voted in favor of the merger agreement. The all-stock, tax-free merger, announced October 26, 2025, combines the two largest US regulated water and wastewater utilities into one serving over 4.7 million connections across 17 states. The combined company will retain the American Water name and will be headquartered in Camden, New Jersey. Closing is expected by the end of Q1 2027, subject to Hart-Scott-Rodino antitrust clearance, public utility commission approvals in multiple states, including Pennsylvania and New Jersey, and other conditions. Separately, on January 12, 2026, BofA Securities lifted American Water stock from Underperform to Neutral and boosted its price target to $139 from $117. BofA highlighted the stock’s depressed pricing versus electric and gas counterparts, where its earnings multiple edge has narrowed from above 140% historically to below 25% currently. The firm anticipated the ongoing merger would counter issues tied to customer bill burdens and the durability of EPS expansion outlook. BofA contended that American Water’s extended 50-to-100-year pipeline upgrades deserve a valuation lift over electric utilities, which share roughly 9% EPS trajectories but hinge on accelerated construction for data center clients. American Water Works Company, Inc. (NYSE:AWK) is a regulated water utility that provides drinking water and wastewater services to approximately 14 million people in 24 states. The company operates pipeline infrastructure totaling more than 54,500 miles, serving around 1,700 communities. While we acknowledge the potential of AWK as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock . READ NEXT: 10 Best S&P 500 Stocks With Highest Upside Potential and 10 Best NYSE Stocks to Buy for the Long Term . Disclosure: None. This article is originally published at Insider Monkey . Terms and Privacy Policy Privacy Dashboard More Info",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Yahoo Finance",
      "title": "Analysts Turn Bullish on Xcel Energy (XEL) Amid Data Center Boom",
      "link": "https://finance.yahoo.com/news/analysts-turn-bullish-xcel-energy-083817808.html",
      "published_date": "2026-02-19T08:38:17Z",
      "scrape_timestamp": "2026-02-20T18:34:27.954384+00:00",
      "content": "Analysts Turn Bullish on Xcel Energy (XEL) Amid Data Center Boom Abdul Rahman Thu, February 19, 2026 at 2:38 AM CST 2 min read XEL XELLL Xcel Energy Inc. (NASDAQ: XEL ) is one of the best infrastructure stocks to buy right now . On February 13, UBS upgraded Xcel Energy Inc. (NASDAQ:XEL) from Neutral to Buy and increased its price target to $89 from $81. Analyst William Appicelli made the upgrade. Analysts Turn Bullish on Xcel Energy (XEL) Amid Data Center Boom Appicelli noted that Xcel has a steady 9% earnings-per-share expansion, backed by full regulatory oversight, plus rising data center electricity needs that remain underappreciated in the current valuation. The analyst also highlighted Xcel’s recent hike in expected data center load to 4 gigawatts from 2 gigawatts. Further upside came from transmission work in the SPP market, and Colorado plans adding 2.1 gigawatts, said Appicelli. As a result, UBS baked in a 7% premium to the sector average for its model. The firm is also eyeing two turns of P/E multiple gains, and dismissed Texas Smokehouse fire resolution costs as under $100 million. Independent of the analyst action, Xcel shared Q4 2025 results on February 5, in which ongoing EPS was $0.96 per share. This figure fell at the lower end of Wall Street’s estimated range, and was up 18.5% year over year. According to the earnings report, quarterly revenue hit $3.56 billion, which narrowly missed the $3.64-$3.77 billion forecast. Nonetheless, the revenue jumped 14.1% year over year. Management attributed the growth to a 14.2% increase in electric and natural gas sales. The company reaffirmed FY2026 ongoing EPS of $4.04-$4.16 and a long-term 6-8+% annual growth through 2030 via $60 billion capex. Xcel Energy Inc. (NASDAQ:XEL) is a regulated utility company. It provides electricity and natural gas to 3.7 million electric customers and 2.1 million natural gas customers across eight states. While we acknowledge the potential of XEL as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock . READ NEXT: 10 Best S&P 500 Stocks With Highest Upside Potential and 10 Best NYSE Stocks to Buy for the Long Term . Disclosure: None. This article is originally published at Insider Monkey . Terms and Privacy Policy Privacy Dashboard More Info",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Yahoo Finance",
      "title": "Goldman Sachs CEO Reveals Personal Bitcoin Investment: “I own very little Bitcoin, but I’m watching it closely”",
      "link": "https://finance.yahoo.com/news/goldman-sachs-ceo-reveals-personal-083321595.html",
      "published_date": "2026-02-19T08:33:21Z",
      "scrape_timestamp": "2026-02-20T18:34:27.954391+00:00",
      "content": "Goldman Sachs CEO Reveals Personal Bitcoin Investment: “I own very little Bitcoin, but I’m watching it closely” Akriti Seth Thu, February 19, 2026 at 2:33 AM CST 1 min read BTC-USD GS ETH-USD “I own very little Bitcoin, but I’m watching it closely,” Goldman Sachs CEO David Solomon revealed while speaking at the World Liberty Forum in Florida on 18 February 2026. I’m an observer of Bitcoin. While Solomon maintained that he owns minimal personal Bitcoin holdings, Goldman Sachs has been cautious in its institutional cryptocurrency strategy. But the bank’s expanding presence in the cryptocurrency sector has been evident. Recently, the bank relaunched its cryptocurrency trading desk and has been actively developing digital asset custody solutions for institutional investors. According to recent SEC filings, Goldman Sachs has built a position of over $2.3 billion in crypto ETFs. Interestingly, the bank holds nearly equal amounts of Bitcoin and Ethereum ETFs. DISCOVER: Top 20 Crypto to Buy in 2026 “Until 10 minutes ago, the regulatory structure was extremely prohibitive” “When you burden this system with excessive regulation, you start to extract capital,” Solomon said. “That absolutely happened in the last five years.” Goldman Sach’s cryptocurrency division serves hedge funds, asset managers, and other institutional clients seeking exposure to Bitcoin and other digital assets through regulated financial products. This client-focused strategy allows Goldman to capitalize on growing institutional demand without requiring executive-level personal conviction. Solomon’s admission fits a growing pattern of acceptance spread across the highest levels of finance. Recently, a BlackRock executive publicly endorsed crypto allocations , reinforcing the idea that Wall Street is moving from “testing the waters” to diving in. DISCOVER: 16+ New and Upcoming Binance Listings in 2026 Read original story Goldman Sachs CEO Reveals Personal Bitcoin Investment: \"I own very little Bitcoin, but I'm watching it closely\" by Akriti Seth at 99bitcoins.com Terms and Privacy Policy Privacy Dashboard More Info",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Yahoo Finance",
      "title": "Sempra (SRE) Confronts Legal Uncertainty, Analysts Adjust Targets",
      "link": "https://finance.yahoo.com/news/sempra-sre-confronts-legal-uncertainty-083822853.html",
      "published_date": "2026-02-19T08:38:22Z",
      "scrape_timestamp": "2026-02-20T18:34:27.954398+00:00",
      "content": "Sempra (SRE) Confronts Legal Uncertainty, Analysts Adjust Targets Abdul Rahman Thu, February 19, 2026 at 2:38 AM CST 2 min read SRE Sempra (NYSE: SRE ) is one of the best infrastructure stocks to buy right now . On January 26, Jefferies’ Julian Dumoulin-Smith lowered his price target on Sempra (NYSE:SRE) to $89 from $95 and kept the Hold recommendation intact. The analyst cited California risks as the reason for the price target reduction. Sempra (SRE) Confronts Legal Uncertainty, Analysts Adjust Targets The adjustment stems from new legal challenges facing SoCalGas, a Sempra unit, over its response to the Eaton fire. This challenge, said Dumoulin-Smith, heightens overall operational uncertainties for the company. The analyst observed that investors previously saw Sempra’s California operations as less exposed to wildfires than competitors, but this perception is now shifting due to this case. As a result, the analyst also trimmed projections to account for changes in California’s capital cost assumptions and outcomes from the track two regulatory process. In a separate update, on January 22, BMO Capital analyst James Thalacker cut the price target on Sempra (NYSE:SRE) to $100 from $103 and reaffirmed an Outperform rating. Thalacker labeled the stock’s recent plunge an overreaction to Southern California Edison’s lawsuit accusing SoCalGas of mishandling the Eaton fire. According to the analyst, he took into account initial fire damage projections and the fact that over 12 defendants face similar claims. As such, Thalacker adjusted downward his projections for Sempra’s California utility segment. He also predicted investor skepticism would linger until Sempra files its defense in the litigation. Sempra (NYSE:SRE) is a San Diego, California-based energy infrastructure company. It provides electricity and natural gas to nearly 40 million consumers across North America. It operates one of the largest energy networks in the region, with assets spanning transmission, distribution, and storage systems. While we acknowledge the potential of SRE as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock . READ NEXT: 10 Best S&P 500 Stocks With Highest Upside Potential and 10 Best NYSE Stocks to Buy for the Long Term . Disclosure: None. This article is originally published at Insider Monkey . Terms and Privacy Policy Privacy Dashboard More Info",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Yahoo Finance",
      "title": "Crown Castle (CCI) Faces DISH Fallout, Analysts Split on Outlook",
      "link": "https://finance.yahoo.com/news/crown-castle-cci-faces-dish-083814705.html",
      "published_date": "2026-02-19T08:38:14Z",
      "scrape_timestamp": "2026-02-20T18:34:27.954409+00:00",
      "content": "Crown Castle (CCI) Faces DISH Fallout, Analysts Split on Outlook Abdul Rahman Thu, February 19, 2026 at 2:38 AM CST 2 min read CCI Crown Castle Inc. (NYSE: CCI ) is one of the best infrastructure stocks to buy right now . On February 9, Citizens analyst Greg Miller reaffirmed a Market Outperform rating and $125 price target on Crown Castle Inc. (NYSE:CCI) following Q4 2025 results. Crown Castle (CCI) Faces DISH Fallout, Analysts Split on Outlook Aleksandr Bagri/Shutterstock.com Miller attributed quarterly headwinds to ongoing disputes with former DISH Network clients after tower agreement terminations. He noted DISH as a recent top growth driver, now contributing about 5% of site rental income. The analyst added that stripping out DISH and Sprint effects, revenue rose 3.5%, and that this trails the firm’s long-term benchmarks. ​Miller anticipated leasing momentum to lift expansion ahead, and observed that “the growth days of the towers are now behind.” He framed Crown Castle as a low-volatility counterbalance to data center exposure in digital infrastructure portfolios. Separately, on February 6, BMO Capital analyst Ari Klein reduced the price target on Crown Castle to $91 from $97 while upholding an Outperform rating. Klein deemed Crown Castle’s FY2026 forecast underwhelming, which he noted was driven by heavier-than-anticipated fallout from DISH Network. According to Klein, DISH’s exit hampered organic growth projections. Also, leasing volumes face a modest dip, excluding DISH. Crown Castle considers roughly 3% organic growth, including Sprint churn, as its minimum, but BMO expects limited near-term gains. As a result, Klein projected initial share weakness on the outlook yet viewed it as clearing hurdles. He added that Crown Castle is primed to gain most from any DISH accord amid timing unknowns. Crown Castle Inc. (NYSE:CCI) is a real estate investment company. It provides shared communications infrastructure across the United States where it owns and operates approximately 40,000 cell towers and 85,000 route miles of fiber. While we acknowledge the potential of CCI as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock . READ NEXT: 10 Best S&P 500 Stocks With Highest Upside Potential and 10 Best NYSE Stocks to Buy for the Long Term . Disclosure: None. This article is originally published at Insider Monkey . newsletter][/daily-newsletter] Terms and Privacy Policy Privacy Dashboard More Info",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Yahoo Finance",
      "title": "Exelon Corporation (EXC) Expands Infrastructure While Delivering Better-Than-Expected EPS",
      "link": "https://finance.yahoo.com/news/exelon-corporation-exc-expands-infrastructure-083820382.html",
      "published_date": "2026-02-19T08:38:20Z",
      "scrape_timestamp": "2026-02-20T18:34:27.954418+00:00",
      "content": "Exelon Corporation (EXC) Expands Infrastructure While Delivering Better-Than-Expected EPS Abdul Rahman Thu, February 19, 2026 at 2:38 AM CST 2 min read EXC NEE Exelon Corporation (NASDAQ: EXC ) is one of the best infrastructure stocks to buy right now . On February 13, PJM Interconnection’s Board of Directors approved a proposed 220-mile, 765-kV high-voltage transmission line project jointly developed by Exelon Corporation (NASDAQ:EXC) and NextEra Energy Transmission, a subsidiary of NextEra Energy Inc. (NYSE:NEE). Exelon Corporation (EXC) Expands Infrastructure While Delivering Better-Than-Expected EPS Pixabay/Public Domain The project connects substations to serve customers in West Virginia, Pennsylvania, and the Mid-Atlantic region. It was selected under PJM’s Regional Transmission Expansion Plan (RTEP) for addressing regional reliability needs beyond local solutions. PJM recommended the line in its 2025 RTEP, with final approval in early 2026. In a different update, on February 12, Exelon reported stronger-than-expected Q4 2025 adjusted operating EPS, which came in at $0.59, beating analyst consensus estimates of $0.57. However, this EPS was down 7.8% year over year due to higher taxes, contracting costs, depreciation, and interest expenses, noted management. Quarterly revenues reached $5.41 billion, which is below the $5.51-$5.54 billion range that Wall Street expected. The revenue was also down 1.1% year over year. Operating expenses fell 3.3% to $4.23 billion, which management noted that it boosted operating income 8% to $1.19 billion. Management issued 2026 adjusted EPS guidance of $2.81-$2.91, which puts the midpoint above $2.83 consensus. The executives added that they plan to call for $41.3 billion in energy infrastructure capex over 2026-2029 to drive 7.9% rate base growth. Exelon Corporation (NASDAQ:EXC) is a Chicago, Illinois-based utility holding company. It delivers electricity and natural gas to more than 10 million customers across the Mid-Atlantic, Midwest, and Northeast regions of the United States. The company operates regulated utilities including ComEd, PECO, BGE, and others, managing extensive transmission and distribution networks. While we acknowledge the potential of EXC as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock . READ NEXT: 10 Best S&P 500 Stocks With Highest Upside Potential and 10 Best NYSE Stocks to Buy for the Long Term . Disclosure: None. This article is originally published at Insider Monkey . Terms and Privacy Policy Privacy Dashboard More Info",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Yahoo Finance",
      "title": "Duke Energy (DUK) Advances Strategy Amid Rising Demand Trends",
      "link": "https://finance.yahoo.com/news/duke-energy-duk-advances-strategy-083806868.html",
      "published_date": "2026-02-19T08:38:06Z",
      "scrape_timestamp": "2026-02-20T18:34:27.954426+00:00",
      "content": "Duke Energy (DUK) Advances Strategy Amid Rising Demand Trends Abdul Rahman Thu, February 19, 2026 at 2:38 AM CST 2 min read DUK DUK-PA Duke Energy Corporation (NYSE: DUK ) is one of the best infrastructure stocks to buy right now . On February 11, Goldman Sachs lifted its price target on Duke Energy Corporation (NYSE:DUK) to $142 from $141 while retaining a Buy rating. Duke Energy (DUK) Advances Strategy Amid Rising Demand Trends Pixbabay/Public Domain ​Goldman focused on Duke’s updated five-year capital investment blueprint totaling $103 billion. The blueprint is a jump from the prior $87 billion forecast, and, according to Duke, it is set to drive 9.6% compound annual rate base expansion through 2030. The bank noted that Duke’s management reiterated EPS growth guidance of 5%-7% annually through 2030. They expect the acceleration toward the top half beginning in 2028, fueled by data center contributions. Goldman viewed this outlook as conservative and projected closer to 8% average EPS advancement over the horizon. This growth, said the bank, will be bolstered by potential for stronger-than-expected electricity demand growth. On the same day, that is February 11, BTIG analyst Alex Kania reaffirmed a Buy rating and $141 price target on Duke. Kania pointed to Duke’s Q4 adjusted EPS of $1.50 that nearly matched BTIG and consensus estimates of $1.49. This performance underscores Duke’s reliable history of hitting targets and delivering on strategy, stated Kania. Kania also praised Duke’s expansions to its generation assets and Energy Supply Agreement backlog, paired with a “de-risked approach” to data center development plans. Although he flagged the updated financing strategy, doubling equity issuances, as “an area worth monitoring,” Kania upheld optimism on overall execution. Duke Energy Corporation (NYSE:DUK) is a Charlotte, North Carolina-based electric power holding company. It operates a diverse portfolio of generation assets, including nuclear, coal, natural gas, hydro, solar, and battery storage. While we acknowledge the potential of DUK as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock . READ NEXT: 10 Best S&P 500 Stocks With Highest Upside Potential and 10 Best NYSE Stocks to Buy for the Long Term . Disclosure: None. This article is originally published at Insider Monkey . Terms and Privacy Policy Privacy Dashboard More Info",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Yahoo Finance",
      "title": "Canary Capital and Grayscale Launch First Spot SUI ETFs with 7% Staking Yields",
      "link": "https://finance.yahoo.com/news/canary-capital-grayscale-launch-first-083330995.html",
      "published_date": "2026-02-19T08:33:30Z",
      "scrape_timestamp": "2026-02-20T18:34:27.954433+00:00",
      "content": "Canary Capital and Grayscale Launch First Spot SUI ETFs with 7% Staking Yields Akriti Seth Thu, February 19, 2026 at 2:33 AM CST 2 min read SUI20947-USD BTC-USD ETH-USD On 18 February 2026, Canary Capital Group and Grayscale Investments launched the first US-listed spot SUI exchange-traded funds. This will give investors regulated access to Sui Network’s native token and approximately 7% staking rewards. Both funds hold physical SUI tokens and stake them on Sui Network’s Proof-of-Stake (PoS) validation mechanism. The Canary Staked SUI ETF (NASDAQ: SUIS) and Grayscale Sui Staking ETF (GSUI) on NYSE Arca represent a major expansion of crypto ETF products beyond Bitcoin and Ethereum. Commenting on the move, Steven McClurg, CEO at Canary Capital said, “The Canary Staked SUI spot ETF (SUIS) brings exposure to SUI in a registered, exchanged-traded structure, while also enabling investors to benefit from net staking rewards generated through SUI’s proof-of-stake mechanism.” DISCOVER: Top 20 Crypto to Buy in 2026 “Sui Network Represents The Evolution Of Blockchain Utility” Net staking rewards currently yield around 7% are reflected in each fund’s net asset value (NAV), allowing shareholders to capture both price appreciation and on-chain yields without managing validators themselves. Grayscale’s GSUI charges a 0.35% annual sponsor fee, waived for the first three months or until assets reach $1 billion. The fund launched with 100% of holdings staked. Canary filed for SUIS in March 2025 and received SEC approval, following the precedent set by spot Bitcoin ETFs in 2024 and Ethereum ETFs in 2025. “The Sui Network represents the evolution of blockchain utility. It’s highly scalable, supported by robust developer activity, and designed for real-world adoption,” said McClurg. Adding to this, Adeniyi Abiodun, Co-Founder and CPO of Mysten Labs, the original contributor to Sui said, “Today marks an important milestone for both institutional and retail access to the Sui ecosystem. Sui was built to serve as the foundation for a new global economy, and this launch unlocks exposure for investors who believe in the technology powering that innovation.” DISCOVER: 16+ New and Upcoming Binance Listings in 2026 SUI Has Been Struggling Along With Other Altcoins SUI’s price has struggled recently alongside broader altcoin downturns. Even with staking rewards, if the underlying asset drops 40%, one is still losing money. This move follows a trend where issuers look for ways to boost value, much like the discussions around BlackRock and Ethereum staking ETF possibilities . One gets the yield without the headache of managing private keys or worrying about technical maintenance yourself. Story Continues However, the institutional signal is what matters here. Just as we saw options trading explode for Bitcoin ETFs , adding staking to altcoin products adds a new layer of sophistication to the market. This paves the way for other “Solana killers” to potentially follow suit. Follow 99Bitcoins on X For the Latest Market Updates and Subscribe on YouTube For Daily Expert Market Analysis. Read original story Canary Capital and Grayscale Launch First Spot SUI ETFs with 7% Staking Yields by Akriti Seth at 99bitcoins.com Terms and Privacy Policy Privacy Dashboard More Info",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Yahoo Finance",
      "title": "Equinix (EQIX): Analysts See Strong Momentum Ahead",
      "link": "https://finance.yahoo.com/news/equinix-eqix-analysts-see-strong-083809897.html",
      "published_date": "2026-02-19T08:38:09Z",
      "scrape_timestamp": "2026-02-20T18:34:27.954440+00:00",
      "content": "Equinix (EQIX): Analysts See Strong Momentum Ahead Abdul Rahman Thu, February 19, 2026 at 2:38 AM CST 2 min read EQIX Equinix, Inc. (NASDAQ: EQIX ) is one of the best infrastructure stocks to buy right now . On February 12, TD Cowen analyst Michael Elias increased the price target on Equinix, Inc. (NASDAQ:EQIX) to $1,123 from $995 and held a Buy rating. Equinix (EQIX): Analysts See Strong Momentum Ahead Elias foresaw revenue acceleration in 2026 and 2027, should booking trends endure. He stated that this could lift adjusted funds from operations per share toward the top of Equinix’s 2025 Investor Day range. Elias noted further that Equinix’s growth potential is supported by its focus on OpEx/capex management. As such, TD Cowen named Equinix its top selection among covered REITs. Meanwhile, on the same day, February 12, Stifel increased its price target on Equinix to $1,075 from $1,020 and reaffirmed a Buy rating. The firm emphasized Equinix’s 2026 projections surpassing Wall Street views, including 9%-10% year over year revenue expansion, EBITDA margins holding at 51%, and adjusted funds from operations per share climbing 8%-10%. This is a clear upgrade from the prior year’s roughly 5%+ trajectory, noted Stifel. Analysts at Stifel attributed Equinix’s outlook to persistent operating leverage and enhanced pricing leverage amid surging demand. The firm believes Equinix is well-positioned to benefit from sustained momentum as it continues to drive improved conversion rates (49% in Q4) of its growing pipeline and faster sales cycles. These dynamics, it believes, are key to unlocking further bookings growth following the record $474 million in Q4. Equinix, Inc. (NASDAQ:EQIX) is a Redwood City, California-based real estate investment company that specializes in global data center and interconnection services. The company operates more than 250 International Business Exchange data centers across 70+ metropolitan areas worldwide. It provides colocation, cloud connectivity, and digital infrastructure solutions to enterprises and service providers. While we acknowledge the potential of EQIX as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock . READ NEXT: 10 Best S&P 500 Stocks With Highest Upside Potential and 10 Best NYSE Stocks to Buy for the Long Term . Disclosure: None. This article is originally published at Insider Monkey . Terms and Privacy Policy Privacy Dashboard More Info",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Yahoo Finance",
      "title": "Williams Companies (WMB) Gains Analyst Confidence with Growth Outlook",
      "link": "https://finance.yahoo.com/news/williams-companies-wmb-gains-analyst-083805854.html",
      "published_date": "2026-02-19T08:38:05Z",
      "scrape_timestamp": "2026-02-20T18:34:27.954447+00:00",
      "content": "Williams Companies (WMB) Gains Analyst Confidence with Growth Outlook Abdul Rahman Thu, February 19, 2026 at 2:38 AM CST 2 min read WMB The Williams Companies, Inc. (NYSE: WMB ) is one of the best infrastructure stocks to buy right now . On February 11, Wells Fargo analyst Praneeth Satish raised the price target on The Williams Companies, Inc. (NYSE:WMB) to $80 from $71 and maintained an Overweight rating. Williams Companies (WMB) Gains Analyst Confidence with Growth Outlook Satish commended Williams’ Analyst Day presentation, in which the company projected over 10% five-year EBITDA compound annual growth from 2025 to 2030. The company said roughly 8% is “locked in” through final investment decision projects alongside modest gathering and processing expansion. Williams announced during the presentation that it won approval on “Socrates The Younger” power initiative and site extensions. This boosted the power backlog to 6 gigawatts from an implied 5 gigawatts and lengthened two contracts to 12.5 years from 10. The company also detailed that it carries $12 billion in active construction contracts and a $37 billion opportunity pipeline. It also holds roughly 10 gigawatts in equipment orders for an extra $14 billion shadow-shadow backlog. In this light, Wells Fargo forecasted a 12% EBITDA CAGR across seven years, which surpassed the Williams guide. Independent of the analyst action, on February 6, Reuters revealed that Williams is exploring the acquisition of US natural gas production assets. The move aims to secure natural gas supplies for its one-stop energy services to hyperscalers and AI data center developers, Reuters said in an exclusive report. If successful, this will position Williams as a single partner over multiple suppliers. The company spent the past year building AI energy leadership, adding power generation to its pipeline business amid data center power demands, Reuters reported. The Williams Companies, Inc. (NYSE:WMB) is an energy infrastructure company. It owns and operates one of the largest natural gas pipeline systems in the United States. The company’s assets also include gathering, processing, and storage facilities. While we acknowledge the potential of WMB as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock . READ NEXT: 10 Best S&P 500 Stocks With Highest Upside Potential and 10 Best NYSE Stocks to Buy for the Long Term . Disclosure: None. This article is originally published at Insider Monkey . Terms and Privacy Policy Privacy Dashboard More Info",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Yahoo Finance",
      "title": "Is WEC Energy Group, Inc. (WEC) One of the Best Infrastructure Stocks to Buy Right Now?",
      "link": "https://finance.yahoo.com/news/wec-energy-group-inc-wec-083823060.html",
      "published_date": "2026-02-19T08:38:23Z",
      "scrape_timestamp": "2026-02-20T18:34:27.954455+00:00",
      "content": "Is WEC Energy Group, Inc. (WEC) One of the Best Infrastructure Stocks to Buy Right Now? Abdul Rahman Thu, February 19, 2026 at 2:38 AM CST 2 min read WEC WEC Energy Group, Inc. (NYSE: WEC ) is one of the best infrastructure stocks to buy right now . On February 6, Mizuho lifted its price target on WEC Energy Group, Inc. (NYSE:WEC) to $121 from $117 and maintained an Outperform rating on the stock. Mizuho said its PT raise was supported by WEC’s strong performance in Q4 2025 financial results, which the company shared the day before. Is WEC Energy Group, Inc. (WEC) One of the Best Infrastructure Stocks to Buy Right Now? Pixabay/Public Domain In the results, WEC Energy’s full-year 2025 earnings per share came in at $5.27, which narrowly beat Wall Street’s expected $5.25. This was an 8% increase over 2024’s adjusted earnings. For the fourth quarter, the company’s net income reached $316.6 million, or $0.97 per share, which compares to the $453.5 million, or $1.43 per share, posted in Q4 2024. WEC Energy initiated a 2026 guidance range of $5.51-$5.61 and forecasted a 6.5%-7% EPS compound annual growth rate this year. For the longer term, the company expects a growth of 7%-8% off the midpoint. Mizuho believes that management’s confidence in future growth is a great boost for investor sentiment, which is why the firm lifted its price target on the shares. Separately, on the same day, February 6, Scotiabank reaffirmed its Sector Outperform rating on WEC Energy Group and kept the $140 price target. The bank said that strong growth prospects driven by increasing data center demand was the key factor supporting its decision. The analysts highlighted WEC’s remarkable track record of exceeding earnings guidance. They also noted that the company has surpassed original EPS guidance midpoints for 22 consecutive years, and expressed confidence in WEC’s guidance of 7%-8% growth. WEC Energy Group, Inc. (NYSE:WEC) is a Milwaukee, Wisconsin-based utility holding company that provides electricity and natural gas to 4.7 million customers across the Midwest. The company operates regulated utilities and transmission networks, mainly through its WEC Infrastructure segment. While we acknowledge the potential of WEC as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock . READ NEXT: 10 Best S&P 500 Stocks With Highest Upside Potential and 10 Best NYSE Stocks to Buy for the Long Term . Disclosure: None. This article is originally published at Insider Monkey . Terms and Privacy Policy Privacy Dashboard More Info",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Yahoo Finance",
      "title": "DA Davidson Assigns TSMC (TSM) a Buy Rating Amid AI Demand Growth",
      "link": "https://finance.yahoo.com/news/da-davidson-assigns-tsmc-tsm-083811149.html",
      "published_date": "2026-02-19T08:38:11Z",
      "scrape_timestamp": "2026-02-20T18:34:27.954462+00:00",
      "content": "DA Davidson Assigns TSMC (TSM) a Buy Rating Amid AI Demand Growth Sheryar Siddiq Thu, February 19, 2026 at 2:38 AM CST 1 min read TSM TSMWF Taiwan Semiconductor Manufacturing Company Limited (NYSE: TSM ) ranks among billionaire Stanley Druckenmiller’s 10 best stock picks . On February 12, DA Davidson began coverage of Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM), issuing it a Buy rating and a $450 price target. The firm stated that the company’s “compounding execution moat in leading edge manufacturing” results in a “durable, self-reinforcing advantage” as interest in artificial intelligence processing grows. Taiwan Semi’s competitive edge, according to DA Davidson, comes from its capacity to “repeatedly industrialize architectural transitions into predictable, high volume platforms,” pointing out that consumers ultimately choose timely delivery of products at a reasonable cost. Although rivals can match specific characteristics “on paper,” the firm states that Taiwan Semi’s advantage lies in its capacity to transform new devices and power architectures into “high yield, high throughput manufacturing with validated enablement and predictable ramps.” Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) is a leading Taiwanese semiconductor manufacturer. The company’s core offerings include wafer fabrication, mask manufacturing, and engineering support services. While we acknowledge the potential of TSM as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock . READ NEXT: 10 Best Magic Formula Stocks for 2025 and 10 Best Retirement Stocks to Buy According to Hedge Funds . Disclosure: None. This article is originally published at Insider Monkey . Terms and Privacy Policy Privacy Dashboard More Info",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Financial Times",
      "title": "Corporate America demands refunds after Trump’s tariffs struck down",
      "link": "https://www.ft.com/content/07a295a3-e323-4a96-af48-ba8d01ab059a",
      "published_date": "Fri, 20 Feb 2026 17:43:57 GMT",
      "scrape_timestamp": "2026-02-20T18:35:06.220934+00:00",
      "content": "Corporate America demands refunds after Trump’s tariffs struck down Subscribe to unlock this article Save 40% on Standard Digital was undefined now undefined for your first year Save now on essential digital access to trusted FT journalism on any device. Savings based on monthly annualised price - offer ends 25th February Save 40% What’s included Standard Digital Stay informed with global news & in-depth analysis Gain clarity from expert opinion First FT: the day’s biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT App on Android & iOS FT Videos & Podcasts 10 monthly gift articles to share Explore more offers. Trial undefined for 4 weeks Then undefined per month. Complete digital access with exclusive insights and industry deep dives on any device. Cancel anytime during your trial. Select What's included Global news & analysis Expert opinion FT App on Android & iOS FT Edit: Access on iOS and web FirstFT: the day's biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT Videos & Podcasts 20 monthly gift articles to share Lex: FT's flagship investment column 15+ Premium newsletters by leading experts FT Digital Edition: our digitised print edition Premium Digital Complete coverage undefined per month Complete digital access with exclusive insights and industry deep dives on any device. Select What's included Global news & analysis Expert opinion FT App on Android & iOS FT Edit: Access on iOS and web FirstFT: the day's biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT Videos & Podcasts 20 monthly gift articles to share Lex: FT's flagship investment column 15+ Premium newsletters by leading experts FT Digital Edition: our digitised print edition FT Digital Edition undefined per year All the content of the FT newspaper on any device (This subscription does not include access to FT.com or the FT App). Select What's included FT Digital Edition: our digitised print edition Global news & analysis Expert opinion Translate instantly to 26 languages Lex: FT's flagship investment column FT Magazines, including HTSI Offline Access Check whether you already have access via your university or organisation. Terms & Conditions apply Explore our full range of subscriptions. For individuals Discover all the plans currently available in your country Digital Print Print + Digital For multiple readers Digital access for organisations. Includes exclusive features and content. FT Professional Why the FT? See why over a million readers pay to read the Financial Times. Find out why",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Financial Times",
      "title": "Met Police probes use of London airports following Epstein files revelations",
      "link": "https://www.ft.com/content/11132602-1161-4311-ba54-8f730d262889",
      "published_date": "Fri, 20 Feb 2026 17:23:53 GMT",
      "scrape_timestamp": "2026-02-20T18:35:07.955965+00:00",
      "content": "Met Police probes use of London airports following Epstein files revelations Subscribe to unlock this article Save 40% on Standard Digital was undefined now undefined for your first year Save now on essential digital access to trusted FT journalism on any device. Savings based on monthly annualised price - offer ends 25th February Save 40% What’s included Standard Digital Stay informed with global news & in-depth analysis Gain clarity from expert opinion First FT: the day’s biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT App on Android & iOS FT Videos & Podcasts 10 monthly gift articles to share Explore more offers. Trial undefined for 4 weeks Then undefined per month. Complete digital access with exclusive insights and industry deep dives on any device. Cancel anytime during your trial. Select What's included Global news & analysis Expert opinion FT App on Android & iOS FT Edit: Access on iOS and web FirstFT: the day's biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT Videos & Podcasts 20 monthly gift articles to share Lex: FT's flagship investment column 15+ Premium newsletters by leading experts FT Digital Edition: our digitised print edition Premium Digital Complete coverage undefined per month Complete digital access with exclusive insights and industry deep dives on any device. Select What's included Global news & analysis Expert opinion FT App on Android & iOS FT Edit: Access on iOS and web FirstFT: the day's biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT Videos & Podcasts 20 monthly gift articles to share Lex: FT's flagship investment column 15+ Premium newsletters by leading experts FT Digital Edition: our digitised print edition FT Digital Edition undefined per year All the content of the FT newspaper on any device (This subscription does not include access to FT.com or the FT App). Select What's included FT Digital Edition: our digitised print edition Global news & analysis Expert opinion Translate instantly to 26 languages Lex: FT's flagship investment column FT Magazines, including HTSI Offline Access Check whether you already have access via your university or organisation. Terms & Conditions apply Explore our full range of subscriptions. For individuals Discover all the plans currently available in your country Digital Print Print + Digital For multiple readers Digital access for organisations. Includes exclusive features and content. FT Professional Why the FT? See why over a million readers pay to read the Financial Times. Find out why",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Financial Times",
      "title": "First shares set to trade on London’s new private markets platform",
      "link": "https://www.ft.com/content/f59d22bb-e382-4e53-a13b-fe643ce03e62",
      "published_date": "Fri, 20 Feb 2026 17:23:24 GMT",
      "scrape_timestamp": "2026-02-20T18:35:08.156167+00:00",
      "content": "First shares set to trade on London’s new private markets platform Subscribe to unlock this article Save 40% on Standard Digital was undefined now undefined for your first year Save now on essential digital access to trusted FT journalism on any device. Savings based on monthly annualised price - offer ends 25th February Save 40% What’s included Standard Digital Stay informed with global news & in-depth analysis Gain clarity from expert opinion First FT: the day’s biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT App on Android & iOS FT Videos & Podcasts 10 monthly gift articles to share Explore more offers. Trial undefined for 4 weeks Then undefined per month. Complete digital access with exclusive insights and industry deep dives on any device. Cancel anytime during your trial. Select What's included Global news & analysis Expert opinion FT App on Android & iOS FT Edit: Access on iOS and web FirstFT: the day's biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT Videos & Podcasts 20 monthly gift articles to share Lex: FT's flagship investment column 15+ Premium newsletters by leading experts FT Digital Edition: our digitised print edition Premium Digital Complete coverage undefined per month Complete digital access with exclusive insights and industry deep dives on any device. Select What's included Global news & analysis Expert opinion FT App on Android & iOS FT Edit: Access on iOS and web FirstFT: the day's biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT Videos & Podcasts 20 monthly gift articles to share Lex: FT's flagship investment column 15+ Premium newsletters by leading experts FT Digital Edition: our digitised print edition FT Digital Edition undefined per year All the content of the FT newspaper on any device (This subscription does not include access to FT.com or the FT App). Select What's included FT Digital Edition: our digitised print edition Global news & analysis Expert opinion Translate instantly to 26 languages Lex: FT's flagship investment column FT Magazines, including HTSI Offline Access Check whether you already have access via your university or organisation. Terms & Conditions apply Explore our full range of subscriptions. For individuals Discover all the plans currently available in your country Digital Print Print + Digital For multiple readers Digital access for organisations. Includes exclusive features and content. FT Professional Why the FT? See why over a million readers pay to read the Financial Times. Find out why",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Yahoo Finance",
      "title": "Starbucks' investor group urges shareholders to replace directors over labor row",
      "link": "https://finance.yahoo.com/news/starbucks-investor-group-urges-shareholders-163226990.html",
      "published_date": "2026-02-19T09:33:40Z",
      "scrape_timestamp": "2026-02-20T19:31:23.470353+00:00",
      "content": "Starbucks' investor group urges shareholders to replace directors over labor row A Starbucks mugs are displayed during the Starbucks Investor Day event in New York City, U.S., January 29, 2026. REUTERS/Brendan McDermid · Reuters Reuters Thu, February 19, 2026 at 3:33 AM CST 2 min read SBUX Feb 18 (Reuters) - Starbucks faced fresh pressure on Wednesday from a coalition of investors including public-sector pension funds that urged shareholders ‌to vote against the reelection of two directors, citing persistent failure ‌to manage labor relations. The move against Starbucks' lead independent director, Jorgen Vig Knudstorp, and Beth ​Ford, chair of the board's Nominating and Corporate Governance Committee, comes as the company is locked in a prolonged effort to reach a collective agreement with its unionized baristas. More than 3,800 baristas had joined a nationwide strike late last ‌year - marking the longest ⁠work stoppage in its history - as the Starbucks Workers United union pressed for better staffing, more predictable schedules and higher ⁠pay after drawn-out contract talks. The dispute has become a high-profile test for CEO Brian Niccol as he works to revive sales. \"We are concerned that, without a ​constructive ​relationship between Starbucks and its unionized workforce, ​sustaining the turnaround may prove ‌difficult,\" the investors said in a letter ahead of the March 25 annual meeting. New York State Comptroller Thomas DiNapoli, New York City Comptroller Mark Levine, Trillium ESG Global Equity Mutual Fund, SOC Investment Group, Merseyside Pension Fund and the Shareholder Association for Research and Education are all signatories. \"We offer the ‌best job in retail with hourly partners earning ​an average of $30 an hour and world-class ​benefits... all for those who ​only work 20 hours a week on average,\" Starbucks ‌said in a statement. The investor group had, ​in January, written ​to the two directors raising concerns over the board's elimination of its Environmental, Partner, and Community Impact Committee without explanation. The committee's responsibilities were reallocated ​across existing committees ‌and the full board reclaimed primary responsibility for labor oversight, Starbucks ​told Reuters on Wednesday. (Reporting by Neil J Kanatt and Juveria Tabassum ​in Bengaluru; Editing by Pooja Desai) Terms and Privacy Policy Privacy Dashboard More Info",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Yahoo Finance",
      "title": "The Stock Market Just Did Something That Hasn't Been Witnessed Since the Dot-Com Bubble Burst in 2000 -- and the Message Couldn't Be Clearer",
      "link": "https://finance.yahoo.com/news/stock-market-just-did-something-092600916.html",
      "published_date": "2026-02-19T09:26:00Z",
      "scrape_timestamp": "2026-02-20T19:31:23.470381+00:00",
      "content": "The Stock Market Just Did Something That Hasn't Been Witnessed Since the Dot-Com Bubble Burst in 2000 -- and the Message Couldn't Be Clearer Sean Williams, The Motley Fool Thu, February 19, 2026 at 3:26 AM CST 6 min read For much of the last seven years, the bulls have been in firm control on Wall Street. The iconic S&P 500 (SNPINDEX: ^GSPC) has gained at least 16% in all but one year since 2019. Meanwhile, the ageless Dow Jones Industrial Average (DJINDICES: ^DJI) just eclipsed 50,000 for the first time in its nearly 130-year history, and the technology-driven Nasdaq Composite (NASDAQINDEX: ^IXIC) has consistently delivered outsize returns. There has been no shortage of catalysts fueling this upside, including the evolution of artificial intelligence (AI) , the advent of quantum computing, the prospect of additional interest rate cuts, and record share buyback activity from S&P 500 companies. Will AI create the world's first trillionaire? Our team just released a report on the one little-known company, called an \"Indispensable Monopoly\" providing the critical technology Nvidia and Intel both need. Continue » Image source: Getty Images. But if history has proven anything, it's that when things seem too good to be true for the stock market, they often are. The benchmark S&P 500 just did something that investors haven't witnessed in more than a quarter century -- and there's no mistaking the message behind this event . This hasn't been observed since the dot-com bubble burst Before going any further, it's worth pointing out that historical correlations can't guarantee short-term directional moves in the Dow, S&P 500, or Nasdaq Composite. Nevertheless, some events have statistically correlated very strongly with directional moves in Wall Street's major stock indexes. It's these historical correlations that tend to raise eyebrows among investors. One historically correlated indicator of intrigue concerns S&P 500 drawdowns. Using data from Bloomberg Finance, investing podcast The Compound labeled every instance since 2000 in which 115 (or more) of the 500 companies that comprise the benchmark index endured at least a 7% single-session drawdown over a rolling eight-day trading period. As you can imagine, instances of heightened downside volatility frequently occurred during short-lived crash events, such as the COVID-19 crash and the week following the unveiling of President Donald Trump's tariff and trade policy, as well as toward the tail-end of bear markets. Over 26 years, the average S&P 500 drawdown from its high was 34% when 115 or more components fell at least 7% in a single session across a rolling eight-day window. Story Continues However, this very specific drawdown indicator just occurred with the S&P 500 only 2% below its all-time high. The only other time since 2000 when 115 or more S&P 500 stocks fell at least 7% over a rolling eight-trading-day window, and the benchmark index was only a few percent below its record high, was the early stages of the dot-com bubble. While nothing is guaranteed, this statistical increase in outsize declines from some of Wall Street's most influential stocks has consistently foreshadowed weakness in equities. This worrisome signal coincides with this being the second-priciest stock market in history, based on readings from the S&P 500's Shiller Price-to-Earnings (P/E) Ratio. The previous five instances in which the Shiller P/E exceeded 30 for at least two months, dating back to January 1871, eventually resulted in the Dow Jones Industrial Average, S&P 500, and/or Nasdaq Composite shedding 20% to 89% of their value. Statistically, Wall Street's bull market looks to be running on borrowed time. Image source: Getty Images. Time and perspective can change everything on Wall Street Although headwinds appear to be mounting for the Dow, S&P 500, and Nasdaq Composite, the outlook for these indexes can vary greatly depending on investors' perspectives and investment timelines. To be blunt, stock market corrections, bear markets, and crash events are normal, healthy, and inevitable. No policy maneuvering from the Federal Reserve or government, nor well-wishing from investors, can stop these often emotion-propelled moves lower in Wall Street's major stock indexes. But taking a step back and recognizing the nonlinearity of stock market cycles is foundational to being a successful investor. Recently, analysts at Bespoke Investment Group published a data set on X (formerly Twitter) that calculated the calendar-day length of every S&P 500 bull and bear market, dating back to the start of the Great Depression in September 1929. What Bespoke's data highlights is the clear disparity in length between bull and bear markets. On one end of the spectrum, the typical 20% or greater decline in the S&P 500 has resolved in 286 calendar days, or about 9.5 months. What's more, no bear market has endured longer than 630 calendar days. In comparison, the average S&P 500 bull market has persisted approximately 3.5 times as long (1,011 calendar days), with 10 of the 27 bull markets spanning 96 years lasting more than 1,200 calendar days. Statistically, wagering on the stock market's major indexes to rise over time has been a wise decision. This means any significant decline in the Dow Jones Industrial Average, S&P 500, and Nasdaq Composite serves as a surefire buying opportunity for investors willing to stay the course for years, if not decades. If history repeats with the S&P 500's drawdown indicator, bargains may abound for investors in the not-too-distant future. Should you buy stock in S&P 500 Index right now? Before you buy stock in S&P 500 Index, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and S&P 500 Index wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Consider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $415,256 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,133,904 !* Now, it’s worth noting Stock Advisor’s total average return is 889 % — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors. See the 10 stocks » *Stock Advisor returns as of February 19, 2026. Sean Williams has no position in any of the stocks mentioned. The Motley Fool has no position in any of the stocks mentioned. The Motley Fool has a disclosure policy . The Stock Market Just Did Something That Hasn't Been Witnessed Since the Dot-Com Bubble Burst in 2000 -- and the Message Couldn't Be Clearer was originally published by The Motley Fool Terms and Privacy Policy Privacy Dashboard More Info",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Yahoo Finance",
      "title": "DoorDash sees strong quarterly growth in sales and orders but warns of big costs",
      "link": "https://finance.yahoo.com/news/doordash-sees-strong-quarterly-growth-211703387.html",
      "published_date": "2026-02-18T21:17:03Z",
      "scrape_timestamp": "2026-02-20T19:31:23.470391+00:00",
      "content": "DoorDash sees strong quarterly growth in sales and orders but warns of big costs DEE-ANN DURBIN Updated Thu, February 19, 2026 at 3:38 AM CST 2 min read DASH ROO.L DoorDash ( DASH ) stock rose 13% during premarket hours on Thursday after announcing on Wednesday that its revenue rose 38% in the fourth quarter as it gained new U.S. customers and added new services like restaurant reservations . But the San Francisco-based delivery company also warned of costly investments ahead. DoorDash CEO and Co-founder Tony Xu said DoorDash is in the midst of building a single tech platform that will bring together its many international businesses. DoorDash bought Wolt , a Finnish delivery service, in 2022, and it acquired Deliveroo , a U.K. rival, last year. Xu said the majority of the tech platform will be completed this year, and even before it's complete, the company will save money and time because it will be able to roll out updates to all of its markets at once. But in the meantime, Xu called the new platform “a massive and expensive undertaking.” “I wish that the tech stack were already here,” Xu said during a conference call with investors Thursday. DoorDash said it expects adjusted pretax earnings between $675 million and $775 million in the first quarter, which was lower than the $800.6 million Wall Street was expecting, according to analysts polled by FactSet. DoorDash also spent heavily during the fourth quarter on multiple projects, including the development of autonomous robot delivery and drone delivery . Its research and development costs rose 41%, for example, while its sales and marketing costs jumped 31%. DoorDash’s net income rose 51% to $213 million, or 49 cents per share. That was lower than the 59-cent profit Wall Street anticipated. DoorDash reported revenue of $3.96 billion for the October-December period. That was also less than the $3.99 billion that analysts forecast. Still, total orders rose 32% to 903 million, beating analysts’ forecast of 884.8 million, according to FactSet. DoorDash said it had more than 56 million active users during the quarter, including 35 million members paying monthly fees to be part of its DashPass, Wolt+ and Deliveroo Plus programs. Xu said customers have always used DoorDash for quick, mid-week orders. But the company is increasingly seeing customers use DoorDash for bigger weekend grocery trips as well. DoorDash and Kroger, the largest U.S. grocery chain, expanded their delivery partnership last fall. Terms and Privacy Policy Privacy Dashboard More Info",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Yahoo Finance",
      "title": "Trying to Cut Retirement Taxes? Avoid This Common Strategy",
      "link": "https://finance.yahoo.com/news/want-minimize-retirement-taxes-dont-201032317.html",
      "published_date": "2026-02-19T09:00:00Z",
      "scrape_timestamp": "2026-02-20T19:31:23.470399+00:00",
      "content": "Trying to Cut Retirement Taxes? Avoid This Common Strategy Brian O'Connor Thu, February 19, 2026 at 3:00 AM CST 5 min read MORN Want to Minimize Retirement Taxes? Don't Follow This Popular Strategy If you’re planning on making tax-deferred retirement accounts the last pot of money you tap after retirement, you’ve got a lot of company. And why not? The idea that your 401(k) or traditional IRA can keep growing and churning out more tax-deferred money seems like a sound strategy. But you may want to rethink this conventional wisdom. Instead of focusing on deferring taxes, Morningstar’s Mark Miller suggests looking at how to minimize your overall total taxes during retirement – which can mean tapping tax-deferred accounts first. A financial advisor can help you decide on an order in which to tap your retirement accounts. “The idea is to use dollars in 401(k) or IRA accounts to meet living expenses — or convert a portion of these assets to Roth IRA accounts — before claiming Social Security in years when your marginal tax rate is lower than it will be after you start to receive benefit,” Miller writes. Tax Considerations in Retirement Want to Minimize Retirement Taxes? Don't Follow This Popular Strategy One consideration Miller highlights is the fact that collecting Social Security benefits while making withdrawals from tax-deferred retirement accounts will very likely mean you’ll pay taxes on your Social Security benefits. Single tax filers who bring in between $25,000 and $34,000 in what the IRS calls “combined income” can be taxed on 50% of their Social Security benefits. Meanwhile, those who earn over $34,000 in combined income will pay taxes on up to 85% of their benefits. The limits for joint tax filers are $32,000 and $44,000. (Combined income is your adjusted gross income, plus nontaxable interest income from bonds and half of your Social Security benefits.) As Miller notes, when Social Security benefits first became taxable in 1984 and then extended in 1994, the legislation didn’t include adjustments to the income levels that trigger what some advisers call the “tax torpedo.” This refers to the combined effect that earned income and Social Security have on a retiree’s tax liability. “The original idea was to tax only relatively high-income beneficiaries, and that remains the case. But the number of people affected is rising. That’s because Social Security benefits are indexed to wage growth and adjusted for inflation, while the income threshold levels used to determine the taxable amount of Social Security benefits are fixed by law and not indexed for wage growth or inflation. What You Can Do Want to Minimize Retirement Taxes? Don't Follow This Popular Strategy Aside from drawing down tax-deferred accounts before claiming Social Security, one way to sidestep this “tax torpedo” is by having Roth assets. Remember, for someone in the 22% tax bracket, each $1 of compounded earnings in a taxable 401(k) or traditional IRA yields just 78 cents – plus the potential tax triggered on Social Security benefits. But every $1 of compounded earnings in a tax-free Roth IRA equates to $1 of retirement income. And because it’s non-taxable, it doesn’t count toward your combined income. Story Continues One of the many considerations for retirees is figuring out how to complete Roth conversions in the most tax-efficient manner possible. Doing so will mean you’ll have more tax-free money to draw upon without adding to your combined income. But you’ll want to keep the amount of money you convert low enough so you’re only subject to the lowest income tax brackets. Alternatively, you could rely strictly on cash from taxable accounts to meet living expenses early in retirement, allowing yourself to delay Social Security benefits. Remember, Social Security increases by 8% every year between your full retirement age (67 for most people today) and age 70. A financial advisor can help you weigh your options for your retirement income strategy. Figuring out how to make this work means each individual will need to run their own numbers, a task that’s not too difficult for people projecting the impact of withdrawals from an IRA plus collecting Social Security benefits. People with additional concerns or complex situations can consult with a financial advisor or tax planner. They can also turn to a lower-cost service like Income Strategy, which calculates Social Security and drawdown sequencing, as Miller notes. Bottom Line Tapping your tax-deferred assets first can help lower your total tax burden in retirement, Morningstar’s Mark Miller writes. This flies in the face of conventional wisdom, which dictates you withdraw tax-deferred assets last, allowing them to continue to grow. But this alternative strategy allows you to defer Social Security and maximize your future benefit. Roth conversions are another way you can generate tax-free income in retirement that won’t add to your combined income. Tax Planning Tips A financial advisor can help you plan for retirement taxes and offer advice on how to draw down your assets in a tax-efficient manner. Finding a financial advisor doesn’t have to be hard. SmartAsset’s free tool matches you with up to three vetted financial advisors who serve your area, and you can interview your advisor matches at no cost to decide which one is right for you. If you’re ready to find an advisor who can help you achieve your financial goals, get started now. If you’re focused on limiting your tax liability in retirement, you may be thinking about moving to a more tax-friendly state. SmartAsset has a retirement tax-friendliness tool designed to help you identify the states that are most and least tax-friendly for retirees. Keep an emergency fund on hand in case you run into unexpected expenses. An emergency fund should be liquid -- in an account that isn't at risk of significant fluctuation like the stock market. The tradeoff is that the value of liquid cash can be eroded by inflation. But a high-interest account allows you to earn compound interest. Compare savings accounts from these banks . Are you a financial advisor looking to grow your business? SmartAsset AMP helps advisors connect with leads and offers marketing automation solutions so you can spend more time making conversions. Learn more about SmartAsset AMP . Photo credit: ©iStock.com/jacoblund, ©iStock.com/adamkaz, ©iStock.com/Luke Chan The post Want to Minimize Retirement Taxes? Don’t Follow This Popular Strategy appeared first on SmartAsset Blog . Terms and Privacy Policy Privacy Dashboard More Info",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Yahoo Finance",
      "title": "Centrica Earnings Slide as Investments Drive Strategic Reset",
      "link": "https://finance.yahoo.com/news/centrica-earnings-slide-investments-drive-084956791.html",
      "published_date": "2026-02-19T08:49:56Z",
      "scrape_timestamp": "2026-02-20T19:31:23.470406+00:00",
      "content": "Centrica Earnings Slide as Investments Drive Strategic Reset Charles Kennedy Thu, February 19, 2026 at 2:49 AM CST 4 min read CPYYF Centrica plc posted lower earnings in 2025 but raised its dividend and pressed ahead with major investments as it targets a step-up in EBITDA by 2030. The UK-based energy and services group reported adjusted EBITDA of £1.4 billion for 2025, down from £2.3 billion in 2024, with adjusted operating profit falling to £814 million from £1.6 billion. Adjusted earnings per share declined to 11.2p from 19.0p a year earlier, reflecting weaker commodity pricing, nuclear outages, and subdued trading conditions. Más de Yahoo Scout Why did Centrica's earnings fall significantly in 2025? What is Centrica's strategy for transforming its portfolio? How much is Centrica investing in nuclear projects? What are Centrica's EBITDA targets through 2030? Statutory results were hit harder. Operating profit fell to £0.1 billion from £1.7 billion in 2024, as Centrica booked £0.7 billion in exceptional charges and remeasurement losses on energy derivatives, alongside £0.5 billion in impairments tied to late-life gas fields and nuclear investments outside Sizewell C. The group reported a statutory loss per share of 1.5p, compared with a 25.7p profit in 2024. Despite the earnings decline, Centrica increased its full-year dividend by 22% to 5.5p per share, up from 4.5p in 2024, in line with its progressive dividend policy. The company returned £1.1 billion to shareholders in 2025, including £0.8 billion via share buybacks and £0.2 billion in dividends, and completed a £2 billion buyback program before pausing further repurchases to prioritize investment opportunities. Net operating cash flow fell to £0.7 billion from £1.1 billion in 2024, while free cash flow swung to a £0.2 billion outflow, reflecting a sharp increase in capital expenditure to £1.2 billion—more than double the prior year’s £0.6 billion. Adjusted net cash declined to £1.5 billion from £2.9 billion, although the balance sheet remains robust. Retail adjusted EBITDA held steady at £0.6 billion, supported by cost discipline and improved performance in Home Services, offsetting weaker UK Home Energy Supply earnings. The company reported customer growth across all retail businesses for the first time in more than a decade, alongside improved customer satisfaction metrics. Optimisation—encompassing gas and power trading—saw adjusted EBITDA halve to £0.2 billion amid challenging market conditions. Infrastructure earnings dropped more sharply. Adjusted EBITDA fell to £0.7 billion from £1.4 billion, reflecting lower realized commodity prices, the pause in Rough gas storage operations, and nuclear outages. Centrica’s 2025 strategy focused on repositioning the portfolio toward more stable, infrastructure-like earnings. The group committed £1.3 billion (capped) to the 3.2 GW Sizewell C nuclear project, securing a real allowed return on equity of 10.8% and targeting a double-digit internal rate of return. It expects the project to build an £8 billion regulated asset base by commercial operation. Leer más The company also acquired a 50% stake in the Grain LNG terminal alongside Energy Capital Partners, investing £0.2 billion in equity for an expected unlevered IRR of around 9%, with potential upside from site expansion. In parallel, Centrica continued reshaping its upstream exposure, divesting most of Spirit Energy’s producing assets except the Morecambe Hub, and extending operating lives at Heysham 1 and Hartlepool nuclear plants to March 2028. It also formalized a partnership with X-energy to explore advanced modular reactor deployment in the UK. Looking ahead, Centrica is targeting £1.7 billion in adjusted EBITDA by the end of 2028, rising to £2.0 billion by 2030, supported by its transformation program, incremental infrastructure investment, and anticipated nuclear life extensions. The guidance midpoint allows for ±£0.3 billion annual volatility. The strategy aligns with broader UK energy policy trends, emphasizing energy security, nuclear expansion, and LNG import resilience following years of gas market volatility. By reallocating capital from upstream production to regulated and contracted infrastructure, Centrica is seeking to reduce earnings cyclicality and improve long-term visibility. While 2025 marked a step down from the windfall conditions of prior years, management framed the year as one of structural repositioning—trading near-term earnings strength for long-duration, infrastructure-backed cash flows. By Charles Kennedy for Oilprice.com More Top Reads From Oilprice.com U.S. Attacks Alleged Drug Boats as Venezuela Oil Crackdown Escalates Ovintiv To Sell Anadarko Energy Assets In $3 Billion Deal Libya Awards Fuel Supply Deals To Western Firms, Aims To Cut Russian Imports Oilprice Intelligence brings you the signals before they become front-page news. This is the same expert analysis read by veteran traders and political advisors. Get it free, twice a week, and you'll always know why the market is moving before everyone else. You get the geopolitical intelligence, the hidden inventory data, and the market whispers that move billions - and we'll send you $389 in premium energy intelligence, on us, just for subscribing. Join 400,000+ readers today. Get access immediately by clicking here. Condiciones y Política de privacidad Privacy Dashboard More Info",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Yahoo Finance",
      "title": "Nebius Group N.V. (NBIS) Strengthens AI Platform With $275M Tavily Deal",
      "link": "https://finance.yahoo.com/news/nebius-group-n-v-nbis-084308279.html",
      "published_date": "2026-02-19T08:43:08Z",
      "scrape_timestamp": "2026-02-20T19:31:23.470413+00:00",
      "content": "Nebius Group N.V. (NBIS) Strengthens AI Platform With $275M Tavily Deal Neha Gupta Thu, February 19, 2026 at 2:43 AM CST 2 min read NBIS Nebius Group N.V. (NASDAQ: NBIS ) is one of the best stocks to buy and hold for the next 6 months . On February 10, Nebius Group NV (NASDAQ:NBIS) reached an agreement to acquire Tavily. With the acquisition, the company gains access to a company that develops software to help artificial intelligence agents search for up-to-date information needed for financial trading and coding. Nebius Group N.V. (NBIS) Strengthens AI Platform With $275M Tavily Deal According to people familiar with the matter, Nebius is to pay $275 million as part of the deal, which will also see Tavily founder and CEO Rotem Weiss join the company. The acquisition will strengthen the company’s efforts to offer software for handling AI workloads while also providing access to open-source models. Additionally, the acquisition will advance Nebius’ strategy of building a unified platform that enables vertical AI companies and enterprises to build, tune, and run autonomous agents. By leveraging Tavily’s agentic search solution, Nebius will also expand its integrated software stack that developers need to assemble and operate enterprise-grade agentic systems. “This acquisition brings the search layer directly into our stack, so developers can focus on their applications instead of managing multiple vendors. Our strategy is clear: provide an open platform that serves everyone from startups to the largest enterprises, giving them the tools to own their AI destiny,” Roman Chernin, co-founder and Chief Business Officer of Nebius, said: Nebius Group N.V. (NASDAQ:NBIS) is focused on building full-stack infrastructure for the artificial intelligence (AI) industry. It provides AI-native cloud computing, large-scale GPU clusters, and developer tools for training and running AI models. While we acknowledge the potential of NBIS as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock . READ NEXT: 11 Best High Return Penny Stocks to Buy Right Now and 10 High-Growth Low PE Stocks to Buy Now . Disclosure: None. This article is originally published at Insider Monkey . Terms and Privacy Policy Privacy Dashboard More Info",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Yahoo Finance",
      "title": "Indonesia’s Central Bank Holds Rates to Maintain Rupiah Stability",
      "link": "https://www.wsj.com/articles/indonesias-central-bank-holds-rates-to-maintain-rupiah-stability-149624da?siteid=yhoof2&yptr=yahoo",
      "published_date": "2026-02-19T09:27:00Z",
      "scrape_timestamp": "2026-02-20T19:31:23.470420+00:00",
      "content": "",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Yahoo Finance",
      "title": "CoreWeave Inc. (CRWV) Eyes Opportunities in Validating AI Performance and Costs",
      "link": "https://finance.yahoo.com/news/coreweave-inc-crwv-eyes-opportunities-084310518.html",
      "published_date": "2026-02-19T08:43:10Z",
      "scrape_timestamp": "2026-02-20T19:31:23.470432+00:00",
      "content": "CoreWeave Inc. (CRWV) Eyes Opportunities in Validating AI Performance and Costs Neha Gupta Thu, February 19, 2026 at 2:43 AM CST 2 min read CRWV CoreWeave Inc. (NASDAQ: CRWV ) is one of the best stocks to buy and hold for the next 6 months . On February 6, CoreWeave Inc. (NASDAQ:CRWV) launched its first big brand campaign called “Ready for Anything, Ready for AI” with Chance the Rapper as the face of it. The campaign shows CoreWeave’s new vision of helping people and companies who are building with AI to go further and innovate faster. CoreWeave Inc. (CRWV) Eyes Opportunities in Validating AI Performance and Costs As AI moves from testing to large-scale use, CoreWeave wants to highlight its role as the backbone for AI projects. The campaign explains how its cloud technology is built to handle big ideas and future growth. With recent acquisitions like Weights & Biases, OpenPipe, and Monolith, CoreWeave is uniting everything under one clear brand identity while continuing to grow quickly. A day earlier on February 5, CoreWeave Inc. unveiled a new solution designed to help organizations validate the performance and costs of artificial intelligence workloads before deployment. CoreWeave ARENA is a new platform that enables testing applications on production-scale infrastructure. It replaces traditional sandbox environments by providing production-scale compute paired with standardized evaluation tools. The platform also provides access to the company’s Mission Control operating system and AI-native infrastructure through the SUNK and CKS platforms. Customers are already reporting performance improvements and cost reductions on leveraging CoreWeave ARENA capabilities. One customer experienced a significant reduction in cost of ownership, while another saw 10 times faster training than with cloud services running on GPU hardware. “Companies are now building products that have to perform in the real world, and quickly. But there’s been a gap between testing a model and actually running it at scale. CoreWeave ARENA closes that gap,” said Chen Goldberg, Senior Vice President of Engineering at CoreWeave. CoreWeave Inc. (NASDAQ:CRWV) is an AI-focused, specialized cloud computing provider that builds and operates large-scale data centers designed specifically for high-performance GPU-accelerated workloads. While we acknowledge the potential of CRWV as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock . READ NEXT: 11 Best High Return Penny Stocks to Buy Right Now and 10 High-Growth Low PE Stocks to Buy Now . Disclosure: None. This article is originally published at Insider Monkey . Terms and Privacy Policy Privacy Dashboard More Info",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Yahoo Finance",
      "title": "BioNTech SE (BNTX) Rallying on Solid Oncology Strategy",
      "link": "https://finance.yahoo.com/news/biontech-se-bntx-rallying-solid-084312260.html",
      "published_date": "2026-02-19T08:43:12Z",
      "scrape_timestamp": "2026-02-20T19:31:23.470440+00:00",
      "content": "BioNTech SE (BNTX) Rallying on Solid Oncology Strategy Neha Gupta Thu, February 19, 2026 at 2:43 AM CST 2 min read BNTX ^SPSIBI BMY BioNTech SE (NASDAQ: BNTX ) is one of the best stocks to buy and hold for the next 6 months . On February 2, research firm Leerink Partners downgraded BioNTech SE (NASDAQ:BNTX) to a Market Perform from an Outperform and set a $113 price target. BioNTech SE (BNTX) Rallying on Solid Oncology Strategy Pixabay/Public Domain The downgrade is in response to the stock rallying from its December lows of $92 to $113. The 24% gain over the same period outpaced the 4% gain of the S&P Biotechnology Select Industry. According to Leerink Partners, the new rating and price target bring the stock in line with its discounted cash flow valuation. Despite the downgrade, the research firm remains confident about BioNTech’s long-term prospects with its oncology strategy. The firm is especially confident about pumitamig, a VEGFA/PD-L1 bispecific antibody partnered with Bristol Myers Squibb. The company remains in a strong financial position with $20.3 billion in cash expected to support the development of the oncology pipeline. Earlier on January 28, the company’s Supervisory Board appointed Kylie Jimenez to the Management Board as Chief People Officer (“CPO”). The appointment aligns with the company’s push to become a multi-product oncology company by 2030. Jimenez will be responsible for shaping and leading BioNTech’s people strategy and its execution. On January 21, BioNTech said the FDA gave Fast Track status to its cancer drug BNT113 for HPV16+ head and neck cancer. The decision is based on early trial results, and the drug is being tested with pembrolizumab to improve survival for patients who currently have limited treatment options. BioNTech SE (NASDAQ:BNTX) is a German biotechnology company that develops immunotherapies and vaccines for cancer, infectious diseases, and other serious conditions. While we acknowledge the potential of BNTX as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock . READ NEXT: 11 Best High Return Penny Stocks to Buy Right Now and 10 High-Growth Low PE Stocks to Buy Now . Disclosure: None. This article is originally published at Insider Monkey . Terms and Privacy Policy Privacy Dashboard More Info",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Yahoo Finance",
      "title": "Strong Analyst Support and Funding Boost Cipher Mining Inc. (CIFR)’s Outlook",
      "link": "https://finance.yahoo.com/news/strong-analyst-support-funding-boost-084307234.html",
      "published_date": "2026-02-19T08:43:07Z",
      "scrape_timestamp": "2026-02-20T19:31:23.470448+00:00",
      "content": "Strong Analyst Support and Funding Boost Cipher Mining Inc. (CIFR)’s Outlook Neha Gupta Thu, February 19, 2026 at 2:43 AM CST 2 min read CIFR BTC-USD Cipher Mining Inc. (NASDAQ: CIFR ) is one of the best stocks to buy and hold for the next 6 months . On February 9, Morgan Stanley initiated coverage of Cipher Mining Inc. (NASDAQ:CIFR) with an Overweight rating and a $38 price target. Strong Analyst Support and Funding Boost Cipher Mining Inc. (CIFR)’s Outlook According to the investment bank, Cipher Mining is one of the Bitcoin mining companies well-positioned to benefit from a pivot to data centers. The investment bank expects Bitcoin companies with established data centers to naturally attract infrastructure investors who value long-term, stable cash flows. Consequently, Morgan Stanley compares Cipher Mining’s business model to data center REITs that trade at 20X EV/FY1 EBITDA. Meanwhile, on February 4, the company’s wholly owned subsidiary, Black Perl Compute LLC, completed a $2 billion 6.125% senior secured note due 2031. The unit is to use net proceeds from the offering to finance the construction costs of the Black Pearl Facility, a high-performance computing data center in Texas. It will also use $232.5 million to reimburse Cipher Mining for its prior equity contribution. Cipher Mining Inc. (NASDAQ:CIFR) constructs and operates industrial-scale data centers in the U.S. for Bitcoin mining, while rapidly pivoting to become a major developer of high-performance computing (HPC) infrastructure for Artificial Intelligence (AI). The company, which is pivoting to hybrid operations, generates revenue from mining and long-term hosting deals. While we acknowledge the potential of CIFR as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock . READ NEXT: 11 Best High Return Penny Stocks to Buy Right Now and 10 High-Growth Low PE Stocks to Buy Now . Disclosure: None. This article is originally published at Insider Monkey . Terms and Privacy Policy Privacy Dashboard More Info",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Yahoo Finance",
      "title": "Harmony Gold Mining Company Ltd. (HMY) Faces Challenges With CSA Copper Mine",
      "link": "https://finance.yahoo.com/news/harmony-gold-mining-company-ltd-084313972.html",
      "published_date": "2026-02-19T08:43:13Z",
      "scrape_timestamp": "2026-02-20T19:31:23.470455+00:00",
      "content": "Harmony Gold Mining Company Ltd. (HMY) Faces Challenges With CSA Copper Mine Neha Gupta Thu, February 19, 2026 at 2:43 AM CST 2 min read HMY HGMCF GC=F MTAL Harmony Gold Mining Company Ltd (NYSE: HMY ) is one of the best stocks to buy and hold for the next 6 months . On February 9, Harmony Gold Mining Company Ltd (NYSE:HMY) confirmed that its newly acquired CSA Copper Mine in Australia requires a capital injection and a strategic rethink. Harmony Gold Mining Company Ltd. (HMY) Faces Challenges With CSA Copper Mine Copyright: tomas1111 / 123RF Stock Photo The company took over the CSA mine in New South Wales last October by acquiring Mac Copper in a deal worth $1.03 billion. The acquisition is part of the company’s push to diversify into copper, as gold mining in South Africa becomes extremely costly due to the depth of the country’s mines. Under Mac Copper, CSA Copper Mine produced 40,000 metric tons of copper per year. However, it is still unclear if it can maintain or increase the output. “It could be up to two years or even more potentially to de-risk and de-bottleneck the mine,” Chief Executive Beyers Nel said. “It is a mine that is constrained at the moment. It is a mine that requires a bit of a rethink and recapitalisation.” Harmony Gold also owns Eva Copper in Queensland, Australia, and is a joint owner with Newmont of Wafi-Golpu, a gold-copper project in Papua New Guinea. Harmony Gold Mining Company Ltd. (NYSE:HMY) is a major, experienced gold producer and specialist with extensive operations in South Africa and Papua New Guinea, and a growing copper portfolio in Australia. It manages the full mining life cycle, including exploration, development, and operation of underground and surface mines, while being a leader in gold tailings retreatment. While we acknowledge the potential of HMY as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock . READ NEXT: 11 Best High Return Penny Stocks to Buy Right Now and 10 High-Growth Low PE Stocks to Buy Now . Disclosure: None. This article is originally published at Insider Monkey . AGB und Datenschutzerklärung Privacy Dashboard More Info",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Yahoo Finance",
      "title": "Billionaire Stanley Druckenmiller Sells Meta Platforms Stock and Buys an AI Stock Up 210,000% Since Its IPO",
      "link": "https://finance.yahoo.com/news/billionaire-stanley-druckenmiller-sells-meta-093200611.html",
      "published_date": "2026-02-19T09:32:00Z",
      "scrape_timestamp": "2026-02-20T19:31:23.470462+00:00",
      "content": "Billionaire Stanley Druckenmiller Sells Meta Platforms Stock and Buys an AI Stock Up 210,000% Since Its IPO Trevor Jennewine, The Motley Fool Thu, February 19, 2026 at 3:32 AM CST 4 min read META AMZN Billionaire Stanley Druckenmiller ran Duquesne Capital between 1981 and 2010. The hedge fund returned about 30% annually without a single down year during that period. Today, Druckenmiller only manages his own money through Duquesne Family Office, and he made some interesting trades in the fourth quarter. He sold his stake in Meta Platforms (NASDAQ: META) and bought shares of Amazon (NASDAQ: AMZN) , a stock up 210,000% since its IPO in 1997. Where to invest $1,000 right now? Our analyst team just revealed what they believe are the 10 best stocks to buy right now, when you join Stock Advisor. See the stocks » Importantly, the fourth quarter ended about 45 days ago, so investors need to reevaluate both companies based on current information before making the same trades. Here are the important details. Image source: Getty Images. Meta Platforms: The stock Stanley Druckenmiller sold in the fourth quarter Meta owns the three most popular social media platforms as measured by monthly active users: Facebook, Instagram, and WhatsApp. That affords the company valuable insight into consumer behavior and interests, which supports precise ad targeting. That advantage has helped Meta become the second-largest adtech company in the world. Meta has doubled down on that advantage by investing heavily in artificial intelligence (AI). The company has developed machine learning models that retrieve, rank, and recommend content, as well as tools that help advertisers create and optimize campaigns. Additionally, Meta has developed custom chips to train and run the underlying models. Meta reported encouraging financial results in the fourth quarter. Revenue increased 24% to $59.9 billion as more engaging content drove an increase in ad impressions, and better ad performance allowed the company to charge more per ad. However, net income increased just 11% to $8.88 per diluted share, growing more slowly than the top line due to aggressive AI spending. Billionaire Bill Ackman at Pershing Square recently told clients, \"We believe concerns around Meta's AI-related spending initiatives are underestimating the company's long-term upside potential from AI.\" For instance, Meta dominates the nascent smart glasses market and sees an opportunity to combine smart glasses with superintelligence to create a product that could eventually replace many smartphone functions. Wall Street estimates the company's earnings will increase at 19% annually over the next three years, which makes the current valuation of 27 times earnings look quite reasonable. Stanley Druckenmiller may have sold Meta due to concerns about the near-term implications of heavy AI spending, but investors with a time horizon of five years should consider buying a position today. Story continues Amazon: The stock Stanley Druckenmiller bought in the fourth quarter Amazon has a strong position in three large industries: It operates the largest e-commerce marketplace in North America and Western Europe, it is the largest retail advertiser in the world (and the third-largest adtech company overall), and Amazon Web Services (AWS) is the largest public cloud in terms of infrastructure and platform services spending. Like Meta, Amazon is leaning into strength in its core markets by investing aggressively in AI. The company has developed hundreds of generative AI applications to improve margins across its retail business, including tools that optimize demand forecasting, inventory placement, workforce productivity, robot efficiency, and last-mile delivery routes. Similarly, AWS has introduced new products and services at every layer of the computing stack: custom AI chips for training and inference workloads at the infrastructure layer, developer tools for creating generative AI and machine learning software at the platform layer, and AI agents for coding, performance monitoring, and security at the application layer. The stock is down 12% since the company announced fourth-quarter earnings, primarily because Amazon plans to spend $200 billion on capital expenditures in 2026 , up 56% from 2025. But investments in AI are bearing fruit: In the fourth quarter, AWS sales accelerated to the fastest pace in 13 quarters, driven in part by triple-digit sales growth in custom chips. And excluding one-time charges, operating margin increased 1.5 percentage points. Wall Street expects Amazon's earnings to increase at 17% annually over the next three years, which makes the current valuation of 29 times earnings look attractive. I think Stanley Druckenmiller made the right call in buying shares in the fourth quarter, and long-term investors should consider doing the same right now. Should you buy stock in Amazon right now? Before you buy stock in Amazon, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Amazon wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Consider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $415,256 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,133,904 !* Now, it’s worth noting Stock Advisor’s total average return is 889 % — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors. See the 10 stocks » *Stock Advisor returns as of February 19, 2026. Trevor Jennewine has positions in Amazon. The Motley Fool has positions in and recommends Amazon and Meta Platforms. The Motley Fool has a disclosure policy . Billionaire Stanley Druckenmiller Sells Meta Platforms Stock and Buys an AI Stock Up 210,000% Since Its IPO was originally published by The Motley Fool Terms and Privacy Policy Privacy Dashboard More Info",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Yahoo Finance",
      "title": "Iren Limited (IREN) is a Buy Amid Pivot from Bitcoin Mining to Data Centers",
      "link": "https://finance.yahoo.com/news/iren-limited-iren-buy-amid-084305544.html",
      "published_date": "2026-02-19T08:43:05Z",
      "scrape_timestamp": "2026-02-20T19:31:23.470469+00:00",
      "content": "Iren Limited (IREN) is a Buy Amid Pivot from Bitcoin Mining to Data Centers Neha Gupta Thu, February 19, 2026 at 2:43 AM CST 2 min read IREN BTC-USD IREN Ltd (NASDAQ: IREN ) is one of the best stocks to buy and hold for the next 6 months . On February 6, analysts at Compass Point reiterated a Buy rating on IREN Ltd (NASDAQ:IREN) and settled on a $105 price target. Iren Limited (IREN) is a Buy Amid Pivot from Bitcoin Mining to Data Centers Source: unsplash The positive stance follows the company expanding its secured power base to 4.5GW of grid-connected power with the addition of 1.6GW from the Oklahoma campus. The company is increasingly advancing deployments in Canada and Texas. Amid the expansion drive, on February 6, research firm Citizens reiterated a Market Outperform rating on IREN Ltd and an $80 price target. Citizens have expressed confidence in IREN Ltd’s long-term prospects amid a strategic pivot from Bitcoin mining to providing higher-quality data center capacity to large-scale customers. The company already has over 2 gigawatts of capacity available to pursue contracts with hyperscalers. In addition, IREN has secured a $3.6 billion in GPU financing for its Microsoft contract on February 5. The financing will supplement Microsoft’s $1.9 billion prepayment, thereby allowing the company to cover 95% of GPU-related capital expenditures for its targeted 140,000-GPU expansion. The expansion drive is expected to deliver $3.4 billion in annual recurring revenue. Iren Limited (NASDAQ:IREN) operates data centers powered by renewable energy, specializing in high-performance computing for artificial intelligence (AI) cloud services and Bitcoin mining. The company recently shifted focus to AI infrastructure, securing major deals, including a $9.7 billion partnership with Microsoft. While we acknowledge the potential of IREN as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock . READ NEXT: 11 Best High Return Penny Stocks to Buy Right Now and 10 High-Growth Low PE Stocks to Buy Now . Disclosure: None. This article is originally published at Insider Monkey . Terms and Privacy Policy Privacy Dashboard More Info",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Yahoo Finance",
      "title": "Is InterDigital, Inc. (IDCC) One of the Best Stocks to Buy and Hold for the Next 6 Months?",
      "link": "https://finance.yahoo.com/news/interdigital-inc-idcc-one-best-084315490.html",
      "published_date": "2026-02-19T08:43:15Z",
      "scrape_timestamp": "2026-02-20T19:31:23.470477+00:00",
      "content": "Is InterDigital, Inc. (IDCC) One of the Best Stocks to Buy and Hold for the Next 6 Months? Neha Gupta Thu, February 19, 2026 at 2:43 AM CST 2 min read IDCC InterDigital Inc. (NASDAQ: IDCC ) is one of the best stocks to buy and hold for the next 6 months . On February 10, InterDigital Inc. (NASDAQ:IDCC) sued Hisense and TCL for allegedly infringing on its intellectual property related to InterDigital’s joint TV licensing program with Sony. Is InterDigital, Inc. (IDCC) One of the Best Stocks to Buy and Hold for the Next 6 Months? The patents in question relate to HEVC, VP9, and AV1 video compression, as well as high dynamic range (HDR) technologies. The company has initiated legal proceedings before the Munich Local Division of the Unified Patent Court in Germany, the Rio de Janeiro State Court in Brazil, and the Delhi High Court in India. “Our decades of investment in foundational research have helped change how we watch our favorite movies and shows, and Hisense and TCL cannot be allowed to continue to infringe our IP, particularly while many of their competitors have taken a license,” said Josh Schmidt, Chief Legal Officer, InterDigital. On February 10, InterDigital inked a strategic collaboration with Razer, a leading global lifestyle brand for gamers. The two are joining forces to establish a center of excellence to enhance the implementation and promotion of haptic technology for improved media experiences. InterDigital, Inc. (NASDAQ:IDCC) is a prominent research and development company that invents foundational technologies for wireless, video, and AI, licensing these innovations to major mobile device, consumer electronics, and IoT manufacturers. It drives industry standards for 5G, 6G, and video compression. While we acknowledge the potential of IDCC as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock . READ NEXT: 11 Best High Return Penny Stocks to Buy Right Now and 10 High-Growth Low PE Stocks to Buy Now . Disclosure: None. This article is originally published at Insider Monkey . Terms and Privacy Policy Privacy Dashboard More Info",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Yahoo Finance",
      "title": "Praxis Precision Medicines, Inc. (PRAX) Gains Analyst Confidence With Ulixacaltamide",
      "link": "https://finance.yahoo.com/news/praxis-precision-medicines-inc-prax-084303189.html",
      "published_date": "2026-02-19T08:43:03Z",
      "scrape_timestamp": "2026-02-20T19:31:23.470483+00:00",
      "content": "Praxis Precision Medicines, Inc. (PRAX) Gains Analyst Confidence With Ulixacaltamide Neha Gupta Thu, February 19, 2026 at 2:43 AM CST 2 min read PRAX Praxis Precision Medicines, Inc. (NASDAQ: PRAX ) is one of the best stocks to buy and hold for the next 6 months . On February 10, Guggenheim raised its price target for Praxis Precision Medicines Inc. (NASDAQ:PRAX) to $800 from $760 while reiterating a Buy rating. Praxis Precision Medicines, Inc. (PRAX) Gains Analyst Confidence With Ulixacaltamide The research firm raised its price target, impressed by the significant market opportunity for ulixacaltamide, the company’s flagship treatment for essential tremor (ET). According to Guggenheim, Praxis Precision is well-positioned to capitalize on one of the largest and underpenetrated markets in neurology. The essential tremor market is valued at over $15 billion, and Praxis Precision is poised to achieve peak sales of $5- $10 billion with ulixacaltamide. Earlier on January 28, Piper Sandler raised the stock’s price target to $1200 from $450 while maintaining an Overweight rating. The significant price target hike is in response to ulixacaltamide’s significant success in essential tremor. In addition, the research firm has touted progress in relutrigine and epileptic encephalopathies (DEEs). The research firm expects the company to achieve more than $20 billion in revenue with less than 5% peak market share. Praxis Precision Medicines, Inc. (NASDAQ:PRAX) is a clinical-stage biopharmaceutical company translating insights from genetic epilepsies into therapies for CNS disorders characterized by an imbalance between neuronal excitation and inhibition. While we acknowledge the potential of PRAX as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock . READ NEXT: 11 Best High Return Penny Stocks to Buy Right Now and 10 High-Growth Low PE Stocks to Buy Now . Disclosure: None. This article is originally published at Insider Monkey . Terms and Privacy Policy Privacy Dashboard More Info",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Yahoo Finance",
      "title": "Fat Brands sued by lender over cash use during bankruptcy",
      "link": "https://finance.yahoo.com/news/fat-brands-sued-lender-over-092400296.html",
      "published_date": "2026-02-19T09:24:00Z",
      "scrape_timestamp": "2026-02-20T19:31:23.513497+00:00",
      "content": "Fat Brands sued by lender over cash use during bankruptcy Julie Littman Thu, February 19, 2026 at 3:24 AM CST 2 min read FAT This story was originally published on Restaurant Dive . To receive daily news and insights, subscribe to our free daily Restaurant Dive newsletter . 352 Capital, one of Fat Brands’ creditors, sued the company last week to contest Fat’s attempt to use management fees and other cash to fund operations during the company’s Chapter 11 bankruptcy process. At issue is Fat’s proposed use of securitization receivables, defined as “certain management fees and other residual amounts payable to FAT Brands as manager of the securitization entities,” according to lawsuit. 352 Capital said that it owns these receivables and Fat cannot use this cash to fund its operations. If 352 Capital wins this case, Fat, which owns Fatburger, Round Table Pizza, Fazzoli’s and more than a dozen other chains, could have difficulty paying for its operations during the bankruptcy process. The creditor, which holds over $100 million of Fat’s debt, has taken issue with Fat Brands in the past. Days before Fat Brands filed for bankruptcy protections on Jan. 27, 352 Capital sued the chain, saying it was owed Class B stocks of Twin Hospitality as collateral for unpaid debt, according to Restaurant Business. Fat Brands and Twin Hospitality declared bankruptcy following months of ongoing talks with various creditors related to more than $1 billion in outstanding debt. The case is complicated as it involves five different securitization trusts secured by different brands. A group of creditors filed an emergency motion in early February calling for CEO Andrew Wiederhorn’s ouster after a $3 million sale of Twin Hospitality stock was completed following the bankruptcy petition date and without court approval. While the emergency motion has been tabled after Fat’s lawyers said issues with corporate governance have been addressed, Wiederhorn’s position could still be contested during an upcoming March court date related to the bankruptcy case, according to a Feb. 10 hearing related to Chapter 11 proceedings. Recommended Reading Fat Brands files for Chapter 11 Terms and Privacy Policy Privacy Dashboard More Info",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Financial Times",
      "title": "Andrew Mountbatten-Windsor arrest highlights vagueness of rules for royals",
      "link": "https://www.ft.com/content/f855da8c-0371-4e9f-8fe2-11e046de95a7",
      "published_date": "Fri, 20 Feb 2026 19:14:25 GMT",
      "scrape_timestamp": "2026-02-20T19:31:59.001934+00:00",
      "content": "Andrew Mountbatten-Windsor arrest highlights vagueness of rules for royals Subscribe to unlock this article Save 40% on Standard Digital was undefined now undefined for your first year Save now on essential digital access to trusted FT journalism on any device. Savings based on monthly annualised price - offer ends 25th February Save 40% What’s included Standard Digital Stay informed with global news & in-depth analysis Gain clarity from expert opinion First FT: the day’s biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT App on Android & iOS FT Videos & Podcasts 10 monthly gift articles to share Explore more offers. Trial undefined for 4 weeks Then undefined per month. Complete digital access with exclusive insights and industry deep dives on any device. Cancel anytime during your trial. Select What's included Global news & analysis Expert opinion FT App on Android & iOS FT Edit: Access on iOS and web FirstFT: the day's biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT Videos & Podcasts 20 monthly gift articles to share Lex: FT's flagship investment column 15+ Premium newsletters by leading experts FT Digital Edition: our digitised print edition Premium Digital Complete coverage undefined per month Complete digital access with exclusive insights and industry deep dives on any device. Select What's included Global news & analysis Expert opinion FT App on Android & iOS FT Edit: Access on iOS and web FirstFT: the day's biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT Videos & Podcasts 20 monthly gift articles to share Lex: FT's flagship investment column 15+ Premium newsletters by leading experts FT Digital Edition: our digitised print edition FT Digital Edition undefined per year All the content of the FT newspaper on any device (This subscription does not include access to FT.com or the FT App). Select What's included FT Digital Edition: our digitised print edition Global news & analysis Expert opinion Translate instantly to 26 languages Lex: FT's flagship investment column FT Magazines, including HTSI Offline Access Check whether you already have access via your university or organisation. Terms & Conditions apply Explore our full range of subscriptions. For individuals Discover all the plans currently available in your country Digital Print Print + Digital For multiple readers Digital access for organisations. Includes exclusive features and content. FT Professional Why the FT? See why over a million readers pay to read the Financial Times. Find out why",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Financial Times",
      "title": "US scraps tighter limits on mercury emissions from coal plants",
      "link": "https://www.ft.com/content/d1f3c1ca-2724-4755-ae6b-c2ab158365ef",
      "published_date": "Fri, 20 Feb 2026 19:11:04 GMT",
      "scrape_timestamp": "2026-02-20T19:31:59.202130+00:00",
      "content": "US scraps tighter limits on mercury emissions from coal plants Subscribe to unlock this article Save 40% on Standard Digital was undefined now undefined for your first year Save now on essential digital access to trusted FT journalism on any device. Savings based on monthly annualised price - offer ends 25th February Save 40% What’s included Standard Digital Stay informed with global news & in-depth analysis Gain clarity from expert opinion First FT: the day’s biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT App on Android & iOS FT Videos & Podcasts 10 monthly gift articles to share Explore more offers. Trial undefined for 4 weeks Then undefined per month. Complete digital access with exclusive insights and industry deep dives on any device. Cancel anytime during your trial. Select What's included Global news & analysis Expert opinion FT App on Android & iOS FT Edit: Access on iOS and web FirstFT: the day's biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT Videos & Podcasts 20 monthly gift articles to share Lex: FT's flagship investment column 15+ Premium newsletters by leading experts FT Digital Edition: our digitised print edition Premium Digital Complete coverage undefined per month Complete digital access with exclusive insights and industry deep dives on any device. Select What's included Global news & analysis Expert opinion FT App on Android & iOS FT Edit: Access on iOS and web FirstFT: the day's biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT Videos & Podcasts 20 monthly gift articles to share Lex: FT's flagship investment column 15+ Premium newsletters by leading experts FT Digital Edition: our digitised print edition FT Digital Edition undefined per year All the content of the FT newspaper on any device (This subscription does not include access to FT.com or the FT App). Select What's included FT Digital Edition: our digitised print edition Global news & analysis Expert opinion Translate instantly to 26 languages Lex: FT's flagship investment column FT Magazines, including HTSI Offline Access Check whether you already have access via your university or organisation. Terms & Conditions apply Explore our full range of subscriptions. For individuals Discover all the plans currently available in your country Digital Print Print + Digital For multiple readers Digital access for organisations. Includes exclusive features and content. FT Professional Why the FT? See why over a million readers pay to read the Financial Times. Find out why",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Financial Times",
      "title": "The problems piling up at fast-fashion giant Shein",
      "link": "https://www.ft.com/content/37796aba-4cfb-42f3-98aa-88f71d649146",
      "published_date": "Fri, 20 Feb 2026 19:01:38 GMT",
      "scrape_timestamp": "2026-02-20T19:31:59.402323+00:00",
      "content": "The problems piling up at fast-fashion giant Shein Subscribe to unlock this article Save 40% on Standard Digital was undefined now undefined for your first year Save now on essential digital access to trusted FT journalism on any device. Savings based on monthly annualised price - offer ends 25th February Save 40% What’s included Standard Digital Stay informed with global news & in-depth analysis Gain clarity from expert opinion First FT: the day’s biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT App on Android & iOS FT Videos & Podcasts 10 monthly gift articles to share Explore more offers. Trial undefined for 4 weeks Then undefined per month. Complete digital access with exclusive insights and industry deep dives on any device. Cancel anytime during your trial. Select What's included Global news & analysis Expert opinion FT App on Android & iOS FT Edit: Access on iOS and web FirstFT: the day's biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT Videos & Podcasts 20 monthly gift articles to share Lex: FT's flagship investment column 15+ Premium newsletters by leading experts FT Digital Edition: our digitised print edition Premium Digital Complete coverage undefined per month Complete digital access with exclusive insights and industry deep dives on any device. Select What's included Global news & analysis Expert opinion FT App on Android & iOS FT Edit: Access on iOS and web FirstFT: the day's biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT Videos & Podcasts 20 monthly gift articles to share Lex: FT's flagship investment column 15+ Premium newsletters by leading experts FT Digital Edition: our digitised print edition FT Digital Edition undefined per year All the content of the FT newspaper on any device (This subscription does not include access to FT.com or the FT App). Select What's included FT Digital Edition: our digitised print edition Global news & analysis Expert opinion Translate instantly to 26 languages Lex: FT's flagship investment column FT Magazines, including HTSI Offline Access Check whether you already have access via your university or organisation. Terms & Conditions apply Explore our full range of subscriptions. For individuals Discover all the plans currently available in your country Digital Print Print + Digital For multiple readers Digital access for organisations. Includes exclusive features and content. FT Professional Why the FT? See why over a million readers pay to read the Financial Times. Find out why",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Financial Times",
      "title": "Cambridge academics revolt over plans to close university’s vet school",
      "link": "https://www.ft.com/content/67556713-711b-4588-9a3a-05837659e9b7",
      "published_date": "Fri, 20 Feb 2026 18:17:42 GMT",
      "scrape_timestamp": "2026-02-20T19:32:00.002918+00:00",
      "content": "Cambridge academics revolt over plans to close university’s vet school Subscribe to unlock this article Save 40% on Standard Digital was undefined now undefined for your first year Save now on essential digital access to trusted FT journalism on any device. Savings based on monthly annualised price - offer ends 25th February Save 40% What’s included Standard Digital Stay informed with global news & in-depth analysis Gain clarity from expert opinion First FT: the day’s biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT App on Android & iOS FT Videos & Podcasts 10 monthly gift articles to share Explore more offers. Trial undefined for 4 weeks Then undefined per month. Complete digital access with exclusive insights and industry deep dives on any device. Cancel anytime during your trial. Select What's included Global news & analysis Expert opinion FT App on Android & iOS FT Edit: Access on iOS and web FirstFT: the day's biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT Videos & Podcasts 20 monthly gift articles to share Lex: FT's flagship investment column 15+ Premium newsletters by leading experts FT Digital Edition: our digitised print edition Premium Digital Complete coverage undefined per month Complete digital access with exclusive insights and industry deep dives on any device. Select What's included Global news & analysis Expert opinion FT App on Android & iOS FT Edit: Access on iOS and web FirstFT: the day's biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT Videos & Podcasts 20 monthly gift articles to share Lex: FT's flagship investment column 15+ Premium newsletters by leading experts FT Digital Edition: our digitised print edition FT Digital Edition undefined per year All the content of the FT newspaper on any device (This subscription does not include access to FT.com or the FT App). Select What's included FT Digital Edition: our digitised print edition Global news & analysis Expert opinion Translate instantly to 26 languages Lex: FT's flagship investment column FT Magazines, including HTSI Offline Access Check whether you already have access via your university or organisation. Terms & Conditions apply Explore our full range of subscriptions. For individuals Discover all the plans currently available in your country Digital Print Print + Digital For multiple readers Digital access for organisations. Includes exclusive features and content. FT Professional Why the FT? See why over a million readers pay to read the Financial Times. Find out why",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Financial Times",
      "title": "Starmer’s government hasn’t practised what it preached",
      "link": "https://www.ft.com/content/d214147a-8595-4f30-afe9-00dda901e6c1",
      "published_date": "Fri, 20 Feb 2026 18:00:08 GMT",
      "scrape_timestamp": "2026-02-20T19:32:00.203123+00:00",
      "content": "Starmer’s government hasn’t practised what it preached Subscribe to unlock this article Save 40% on Standard Digital was undefined now undefined for your first year Save now on essential digital access to trusted FT journalism on any device. Savings based on monthly annualised price - offer ends 25th February Save 40% What’s included Standard Digital Stay informed with global news & in-depth analysis Gain clarity from expert opinion First FT: the day’s biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT App on Android & iOS FT Videos & Podcasts 10 monthly gift articles to share Explore more offers. Trial undefined for 4 weeks Then undefined per month. Complete digital access with exclusive insights and industry deep dives on any device. Cancel anytime during your trial. Select What's included Global news & analysis Expert opinion FT App on Android & iOS FT Edit: Access on iOS and web FirstFT: the day's biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT Videos & Podcasts 20 monthly gift articles to share Lex: FT's flagship investment column 15+ Premium newsletters by leading experts FT Digital Edition: our digitised print edition Premium Digital Complete coverage undefined per month Complete digital access with exclusive insights and industry deep dives on any device. Select What's included Global news & analysis Expert opinion FT App on Android & iOS FT Edit: Access on iOS and web FirstFT: the day's biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT Videos & Podcasts 20 monthly gift articles to share Lex: FT's flagship investment column 15+ Premium newsletters by leading experts FT Digital Edition: our digitised print edition FT Digital Edition undefined per year All the content of the FT newspaper on any device (This subscription does not include access to FT.com or the FT App). Select What's included FT Digital Edition: our digitised print edition Global news & analysis Expert opinion Translate instantly to 26 languages Lex: FT's flagship investment column FT Magazines, including HTSI Offline Access Check whether you already have access via your university or organisation. Terms & Conditions apply Explore our full range of subscriptions. For individuals Discover all the plans currently available in your country Digital Print Print + Digital For multiple readers Digital access for organisations. Includes exclusive features and content. FT Professional Why the FT? See why over a million readers pay to read the Financial Times. Find out why",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    },
    {
      "source": "Financial Times",
      "title": "Main Street banks are pushing into markets and trading",
      "link": "https://www.ft.com/content/37889be3-2ace-4855-96aa-be34eb0bb80f",
      "published_date": "Fri, 20 Feb 2026 18:00:08 GMT",
      "scrape_timestamp": "2026-02-20T19:32:00.403320+00:00",
      "content": "Main Street banks are pushing into markets and trading Subscribe to unlock this article Save 40% on Standard Digital was undefined now undefined for your first year Save now on essential digital access to trusted FT journalism on any device. Savings based on monthly annualised price - offer ends 25th February Save 40% What’s included Standard Digital Stay informed with global news & in-depth analysis Gain clarity from expert opinion First FT: the day’s biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT App on Android & iOS FT Videos & Podcasts 10 monthly gift articles to share Explore more offers. Trial undefined for 4 weeks Then undefined per month. Complete digital access with exclusive insights and industry deep dives on any device. Cancel anytime during your trial. Select What's included Global news & analysis Expert opinion FT App on Android & iOS FT Edit: Access on iOS and web FirstFT: the day's biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT Videos & Podcasts 20 monthly gift articles to share Lex: FT's flagship investment column 15+ Premium newsletters by leading experts FT Digital Edition: our digitised print edition Premium Digital Complete coverage undefined per month Complete digital access with exclusive insights and industry deep dives on any device. Select What's included Global news & analysis Expert opinion FT App on Android & iOS FT Edit: Access on iOS and web FirstFT: the day's biggest stories 20+ curated newsletters Follow topics & set alerts with myFT FT Videos & Podcasts 20 monthly gift articles to share Lex: FT's flagship investment column 15+ Premium newsletters by leading experts FT Digital Edition: our digitised print edition FT Digital Edition undefined per year All the content of the FT newspaper on any device (This subscription does not include access to FT.com or the FT App). Select What's included FT Digital Edition: our digitised print edition Global news & analysis Expert opinion Translate instantly to 26 languages Lex: FT's flagship investment column FT Magazines, including HTSI Offline Access Check whether you already have access via your university or organisation. Terms & Conditions apply Explore our full range of subscriptions. For individuals Discover all the plans currently available in your country Digital Print Print + Digital For multiple readers Digital access for organisations. Includes exclusive features and content. FT Professional Why the FT? See why over a million readers pay to read the Financial Times. Find out why",
      "score": 0.0,
      "themes": [],
      "is_relevant": false
    }
  ],
  "last_updated": "2026-02-20T19:32:27.881933+00:00",
  "metadata": {
    "total_runs": 3,
    "sources": [
      "Yahoo Finance",
      "Financial Times"
    ],
    "retention_days": 7
  }
}